Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0xd9 (32-bit)
   Version:       4
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x69eb2): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0x1c253): ../Core/Blindspot/blindspot_prog.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0x83fa7): D:/STM32CubeIDE/workspace_1.12.0/ADAS/NTI_RTOS_MOTOR_USART_SELF_UPDATED_GP/Debug
    <19>   DW_AT_ranges      : 0x0
    <1d>   DW_AT_low_pc      : 0x0
    <21>   DW_AT_stmt_list   : 0x0
    <25>   DW_AT_GNU_macros  : 0x0
 <1><29>: Abbrev Number: 2 (DW_TAG_base_type)
    <2a>   DW_AT_byte_size   : 1
    <2b>   DW_AT_encoding    : 6	(signed char)
    <2c>   DW_AT_name        : (indirect string, offset: 0x645bf): signed char
 <1><30>: Abbrev Number: 3 (DW_TAG_typedef)
    <31>   DW_AT_name        : (indirect string, offset: 0x812a): __uint8_t
    <35>   DW_AT_decl_file   : 2
    <36>   DW_AT_decl_line   : 43
    <37>   DW_AT_decl_column : 24
    <38>   DW_AT_type        : <0x3c>
 <1><3c>: Abbrev Number: 2 (DW_TAG_base_type)
    <3d>   DW_AT_byte_size   : 1

    <b3>   DW_AT_prototyped  : 1
    <b3>   DW_AT_type        : <0x7b>
    <b7>   DW_AT_low_pc      : 0x8000e70
    <bb>   DW_AT_high_pc     : 0x44
    <bf>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <c1>   DW_AT_GNU_all_tail_call_sites: 1
    <c1>   DW_AT_sibling     : <0xd5>
 <2><c5>: Abbrev Number: 8 (DW_TAG_variable)
    <c6>   DW_AT_name        : (indirect string, offset: 0x8bfc6): distance
    <ca>   DW_AT_decl_file   : 1
    <cb>   DW_AT_decl_line   : 15
    <cc>   DW_AT_decl_column : 12
    <cd>   DW_AT_type        : <0xd5>
    <d1>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><d4>: Abbrev Number: 0
 <1><d5>: Abbrev Number: 2 (DW_TAG_base_type)
    <d6>   DW_AT_byte_size   : 8
    <d7>   DW_AT_encoding    : 4	(float)
    <d8>   DW_AT_name        : (indirect string, offset: 0x8688c): double
 <1><dc>: Abbrev Number: 0
  Compilation Unit @ offset 0xdd:
   Length:        0x53b (32-bit)
   Version:       4
   Abbrev Offset: 0x89
   Pointer Size:  4
 <0><e8>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <e9>   DW_AT_producer    : (indirect string, offset: 0x69eb2): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <ed>   DW_AT_language    : 12	(ANSI C99)
    <ee>   DW_AT_name        : (indirect string, offset: 0x89c72): ../Core/DCMotor/DCMotor.c
    <f2>   DW_AT_comp_dir    : (indirect string, offset: 0x83fa7): D:/STM32CubeIDE/workspace_1.12.0/ADAS/NTI_RTOS_MOTOR_USART_SELF_UPDATED_GP/Debug
    <f6>   DW_AT_ranges      : 0x10
    <fa>   DW_AT_low_pc      : 0x0
    <fe>   DW_AT_stmt_list   : 0x70d
    <102>   DW_AT_GNU_macros  : 0x142af
 <1><106>: Abbrev Number: 2 (DW_TAG_base_type)
    <107>   DW_AT_byte_size   : 1
    <108>   DW_AT_encoding    : 6	(signed char)
    <109>   DW_AT_name        : (indirect string, offset: 0x645bf): signed char
 <1><10d>: Abbrev Number: 3 (DW_TAG_typedef)
    <10e>   DW_AT_name        : (indirect string, offset: 0x812a): __uint8_t
    <112>   DW_AT_decl_file   : 2
    <113>   DW_AT_decl_line   : 43
    <114>   DW_AT_decl_column : 24
    <115>   DW_AT_type        : <0x119>
 <1><119>: Abbrev Number: 2 (DW_TAG_base_type)
    <11a>   DW_AT_byte_size   : 1
    <11b>   DW_AT_encoding    : 8	(unsigned char)
    <11c>   DW_AT_name        : (indirect string, offset: 0x60862): unsigned char
 <1><120>: Abbrev Number: 2 (DW_TAG_base_type)
    <121>   DW_AT_byte_size   : 2
    <122>   DW_AT_encoding    : 5	(signed)
    <123>   DW_AT_name        : (indirect string, offset: 0x51e6): short int
 <1><127>: Abbrev Number: 3 (DW_TAG_typedef)
    <128>   DW_AT_name        : (indirect string, offset: 0x89d53): __uint16_t
    <12c>   DW_AT_decl_file   : 2
    <12d>   DW_AT_decl_line   : 57
    <12e>   DW_AT_decl_column : 25
    <12f>   DW_AT_type        : <0x133>
 <1><133>: Abbrev Number: 2 (DW_TAG_base_type)
    <134>   DW_AT_byte_size   : 2
    <135>   DW_AT_encoding    : 7	(unsigned)
    <136>   DW_AT_name        : (indirect string, offset: 0x43ab1): short unsigned int
 <1><13a>: Abbrev Number: 2 (DW_TAG_base_type)
    <13b>   DW_AT_byte_size   : 4
    <13c>   DW_AT_encoding    : 5	(signed)
    <13d>   DW_AT_name        : (indirect string, offset: 0x1adbd): long int
 <1><141>: Abbrev Number: 3 (DW_TAG_typedef)
    <142>   DW_AT_name        : (indirect string, offset: 0x88fe3): __uint32_t
    <146>   DW_AT_decl_file   : 2
    <147>   DW_AT_decl_line   : 79
    <148>   DW_AT_decl_column : 25
    <149>   DW_AT_type        : <0x14d>
 <1><14d>: Abbrev Number: 2 (DW_TAG_base_type)
    <14e>   DW_AT_byte_size   : 4
    <14f>   DW_AT_encoding    : 7	(unsigned)
    <150>   DW_AT_name        : (indirect string, offset: 0x4f275): long unsigned int
 <1><154>: Abbrev Number: 2 (DW_TAG_base_type)
    <155>   DW_AT_byte_size   : 8
    <156>   DW_AT_encoding    : 5	(signed)
    <157>   DW_AT_name        : (indirect string, offset: 0x35c83): long long int
 <1><15b>: Abbrev Number: 2 (DW_TAG_base_type)
    <15c>   DW_AT_byte_size   : 8
    <15d>   DW_AT_encoding    : 7	(unsigned)
    <15e>   DW_AT_name        : (indirect string, offset: 0x2e2ba): long long unsigned int
 <1><162>: Abbrev Number: 4 (DW_TAG_base_type)
    <163>   DW_AT_byte_size   : 4
    <164>   DW_AT_encoding    : 5	(signed)
    <165>   DW_AT_name        : int
 <1><169>: Abbrev Number: 2 (DW_TAG_base_type)
    <16a>   DW_AT_byte_size   : 4
    <16b>   DW_AT_encoding    : 7	(unsigned)
    <16c>   DW_AT_name        : (indirect string, offset: 0x48b60): unsigned int
 <1><170>: Abbrev Number: 3 (DW_TAG_typedef)
    <171>   DW_AT_name        : (indirect string, offset: 0x812c): uint8_t
    <175>   DW_AT_decl_file   : 3
    <176>   DW_AT_decl_line   : 24
    <177>   DW_AT_decl_column : 19
    <178>   DW_AT_type        : <0x10d>
 <1><17c>: Abbrev Number: 3 (DW_TAG_typedef)
    <17d>   DW_AT_name        : (indirect string, offset: 0x89656): uint16_t
    <181>   DW_AT_decl_file   : 3
    <182>   DW_AT_decl_line   : 36
    <183>   DW_AT_decl_column : 20
    <184>   DW_AT_type        : <0x127>
 <1><188>: Abbrev Number: 3 (DW_TAG_typedef)
    <189>   DW_AT_name        : (indirect string, offset: 0x89636): uint32_t
    <18d>   DW_AT_decl_file   : 3
    <18e>   DW_AT_decl_line   : 48
    <18f>   DW_AT_decl_column : 20
    <190>   DW_AT_type        : <0x141>
 <1><194>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <195>   DW_AT_type        : <0x188>
 <1><199>: Abbrev Number: 6 (DW_TAG_structure_type)
    <19a>   DW_AT_byte_size   : 40
    <19b>   DW_AT_decl_file   : 4
    <19c>   DW_AT_decl_line   : 264
    <19e>   DW_AT_decl_column : 9
    <19f>   DW_AT_sibling     : <0x222>
 <2><1a3>: Abbrev Number: 7 (DW_TAG_member)
    <1a4>   DW_AT_name        : (indirect string, offset: 0x85fb4): MODER
    <1a8>   DW_AT_decl_file   : 4
    <1a9>   DW_AT_decl_line   : 266
    <1ab>   DW_AT_decl_column : 17
    <1ac>   DW_AT_type        : <0x194>
    <1b0>   DW_AT_data_member_location: 0
 <2><1b1>: Abbrev Number: 7 (DW_TAG_member)
    <1b2>   DW_AT_name        : (indirect string, offset: 0x89b05): OTYPER
    <1b6>   DW_AT_decl_file   : 4
    <1b7>   DW_AT_decl_line   : 267
    <1b9>   DW_AT_decl_column : 17
    <1ba>   DW_AT_type        : <0x194>
    <1be>   DW_AT_data_member_location: 4
 <2><1bf>: Abbrev Number: 7 (DW_TAG_member)
    <1c0>   DW_AT_name        : (indirect string, offset: 0x8a2c1): OSPEEDR
    <1c4>   DW_AT_decl_file   : 4
    <1c5>   DW_AT_decl_line   : 268
    <1c7>   DW_AT_decl_column : 17
    <1c8>   DW_AT_type        : <0x194>
    <1cc>   DW_AT_data_member_location: 8
 <2><1cd>: Abbrev Number: 7 (DW_TAG_member)
    <1ce>   DW_AT_name        : (indirect string, offset: 0x86f6e): PUPDR
    <1d2>   DW_AT_decl_file   : 4
    <1d3>   DW_AT_decl_line   : 269
    <1d5>   DW_AT_decl_column : 17
    <1d6>   DW_AT_type        : <0x194>
    <1da>   DW_AT_data_member_location: 12
 <2><1db>: Abbrev Number: 8 (DW_TAG_member)
    <1dc>   DW_AT_name        : IDR
    <1e0>   DW_AT_decl_file   : 4
    <1e1>   DW_AT_decl_line   : 270
    <1e3>   DW_AT_decl_column : 17
    <1e4>   DW_AT_type        : <0x194>
    <1e8>   DW_AT_data_member_location: 16
 <2><1e9>: Abbrev Number: 8 (DW_TAG_member)
    <1ea>   DW_AT_name        : ODR
    <1ee>   DW_AT_decl_file   : 4
    <1ef>   DW_AT_decl_line   : 271
    <1f1>   DW_AT_decl_column : 17
    <1f2>   DW_AT_type        : <0x194>
    <1f6>   DW_AT_data_member_location: 20
 <2><1f7>: Abbrev Number: 7 (DW_TAG_member)
    <1f8>   DW_AT_name        : (indirect string, offset: 0x8738f): BSRR
    <1fc>   DW_AT_decl_file   : 4
    <1fd>   DW_AT_decl_line   : 272
    <1ff>   DW_AT_decl_column : 17
    <200>   DW_AT_type        : <0x194>
    <204>   DW_AT_data_member_location: 24
 <2><205>: Abbrev Number: 7 (DW_TAG_member)
    <206>   DW_AT_name        : (indirect string, offset: 0x8a0f8): LCKR
    <20a>   DW_AT_decl_file   : 4
    <20b>   DW_AT_decl_line   : 273
    <20d>   DW_AT_decl_column : 17
    <20e>   DW_AT_type        : <0x194>
    <212>   DW_AT_data_member_location: 28
 <2><213>: Abbrev Number: 8 (DW_TAG_member)
    <214>   DW_AT_name        : AFR
    <218>   DW_AT_decl_file   : 4
    <219>   DW_AT_decl_line   : 274
    <21b>   DW_AT_decl_column : 17
    <21c>   DW_AT_type        : <0x232>
    <220>   DW_AT_data_member_location: 32
 <2><221>: Abbrev Number: 0
 <1><222>: Abbrev Number: 9 (DW_TAG_array_type)
    <223>   DW_AT_type        : <0x194>
    <227>   DW_AT_sibling     : <0x232>
 <2><22b>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <22c>   DW_AT_type        : <0x169>
    <230>   DW_AT_upper_bound : 1
 <2><231>: Abbrev Number: 0
 <1><232>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <233>   DW_AT_type        : <0x222>
 <1><237>: Abbrev Number: 11 (DW_TAG_typedef)
    <238>   DW_AT_name        : (indirect string, offset: 0x8a973): GPIO_TypeDef
    <23c>   DW_AT_decl_file   : 4
    <23d>   DW_AT_decl_line   : 275
    <23f>   DW_AT_decl_column : 3
    <240>   DW_AT_type        : <0x199>
 <1><244>: Abbrev Number: 2 (DW_TAG_base_type)
    <245>   DW_AT_byte_size   : 8
    <246>   DW_AT_encoding    : 4	(float)
    <247>   DW_AT_name        : (indirect string, offset: 0x8ee18): long double
 <1><24b>: Abbrev Number: 12 (DW_TAG_enumeration_type)
    <24c>   DW_AT_encoding    : 7	(unsigned)
    <24d>   DW_AT_byte_size   : 1
    <24e>   DW_AT_type        : <0x119>
    <252>   DW_AT_decl_file   : 5
    <253>   DW_AT_decl_line   : 68
    <254>   DW_AT_decl_column : 1
    <255>   DW_AT_sibling     : <0x266>
 <2><259>: Abbrev Number: 13 (DW_TAG_enumerator)
    <25a>   DW_AT_name        : (indirect string, offset: 0x87218): GPIO_PIN_RESET
    <25e>   DW_AT_const_value : 0
 <2><25f>: Abbrev Number: 13 (DW_TAG_enumerator)
    <260>   DW_AT_name        : (indirect string, offset: 0x86f29): GPIO_PIN_SET
    <264>   DW_AT_const_value : 1
 <2><265>: Abbrev Number: 0
 <1><266>: Abbrev Number: 3 (DW_TAG_typedef)
    <267>   DW_AT_name        : (indirect string, offset: 0x8aaa4): GPIO_PinState
    <26b>   DW_AT_decl_file   : 5
    <26c>   DW_AT_decl_line   : 71
    <26d>   DW_AT_decl_column : 2
    <26e>   DW_AT_type        : <0x24b>
 <1><272>: Abbrev Number: 14 (DW_TAG_pointer_type)
    <273>   DW_AT_byte_size   : 4
 <1><274>: Abbrev Number: 12 (DW_TAG_enumeration_type)
    <275>   DW_AT_encoding    : 7	(unsigned)
    <276>   DW_AT_byte_size   : 1
    <277>   DW_AT_type        : <0x119>
    <27b>   DW_AT_decl_file   : 6
    <27c>   DW_AT_decl_line   : 15
    <27d>   DW_AT_decl_column : 7
    <27e>   DW_AT_sibling     : <0x29b>
 <2><282>: Abbrev Number: 13 (DW_TAG_enumerator)
    <283>   DW_AT_name        : (indirect string, offset: 0x8a118): MOTOR_MODIFY_NONE
    <287>   DW_AT_const_value : 0
 <2><288>: Abbrev Number: 13 (DW_TAG_enumerator)
    <289>   DW_AT_name        : (indirect string, offset: 0x883c9): MOTOR_MODIFY_DIR
    <28d>   DW_AT_const_value : 1
 <2><28e>: Abbrev Number: 13 (DW_TAG_enumerator)
    <28f>   DW_AT_name        : (indirect string, offset: 0x8841e): MOTOR_MODIFY_SPEED
    <293>   DW_AT_const_value : 2
 <2><294>: Abbrev Number: 13 (DW_TAG_enumerator)
    <295>   DW_AT_name        : (indirect string, offset: 0x863fc): MOTOR_MODIFY_ALL
    <299>   DW_AT_const_value : 3
 <2><29a>: Abbrev Number: 0
 <1><29b>: Abbrev Number: 12 (DW_TAG_enumeration_type)
    <29c>   DW_AT_encoding    : 7	(unsigned)
    <29d>   DW_AT_byte_size   : 1
    <29e>   DW_AT_type        : <0x119>
    <2a2>   DW_AT_decl_file   : 6
    <2a3>   DW_AT_decl_line   : 23
    <2a4>   DW_AT_decl_column : 3
    <2a5>   DW_AT_sibling     : <0x2bc>
 <2><2a9>: Abbrev Number: 13 (DW_TAG_enumerator)
    <2aa>   DW_AT_name        : (indirect string, offset: 0x8791c): MOTOR_OFF
    <2ae>   DW_AT_const_value : 0
 <2><2af>: Abbrev Number: 13 (DW_TAG_enumerator)
    <2b0>   DW_AT_name        : (indirect string, offset: 0x8a7c1): MOTOR_FWD
    <2b4>   DW_AT_const_value : 2
 <2><2b5>: Abbrev Number: 13 (DW_TAG_enumerator)
    <2b6>   DW_AT_name        : (indirect string, offset: 0x8664d): MOTOR_REV
    <2ba>   DW_AT_const_value : 4
 <2><2bb>: Abbrev Number: 0
 <1><2bc>: Abbrev Number: 15 (DW_TAG_structure_type)
    <2bd>   DW_AT_name        : (indirect string, offset: 0x87610): motorControl_entity
    <2c1>   DW_AT_byte_size   : 3
    <2c2>   DW_AT_decl_file   : 6
    <2c3>   DW_AT_decl_line   : 13
    <2c4>   DW_AT_decl_column : 9
    <2c5>   DW_AT_sibling     : <0x2f1>
 <2><2c9>: Abbrev Number: 16 (DW_TAG_member)
    <2ca>   DW_AT_name        : (indirect string, offset: 0x868ca): modify
    <2ce>   DW_AT_decl_file   : 6
    <2cf>   DW_AT_decl_line   : 20
    <2d0>   DW_AT_decl_column : 5
    <2d1>   DW_AT_type        : <0x274>
    <2d5>   DW_AT_data_member_location: 0
 <2><2d6>: Abbrev Number: 16 (DW_TAG_member)
    <2d7>   DW_AT_name        : (indirect string, offset: 0x8fc43): speed
    <2db>   DW_AT_decl_file   : 6
    <2dc>   DW_AT_decl_line   : 21
    <2dd>   DW_AT_decl_column : 11
    <2de>   DW_AT_type        : <0x170>
    <2e2>   DW_AT_data_member_location: 1
 <2><2e3>: Abbrev Number: 16 (DW_TAG_member)
    <2e4>   DW_AT_name        : (indirect string, offset: 0x86029): control
    <2e8>   DW_AT_decl_file   : 6
    <2e9>   DW_AT_decl_line   : 27
    <2ea>   DW_AT_decl_column : 5
    <2eb>   DW_AT_type        : <0x29b>
    <2ef>   DW_AT_data_member_location: 2
 <2><2f0>: Abbrev Number: 0
 <1><2f1>: Abbrev Number: 17 (DW_TAG_structure_type)
    <2f2>   DW_AT_byte_size   : 6
    <2f3>   DW_AT_decl_file   : 6
    <2f4>   DW_AT_decl_line   : 11
    <2f5>   DW_AT_decl_column : 9
    <2f6>   DW_AT_sibling     : <0x308>
 <2><2fa>: Abbrev Number: 16 (DW_TAG_member)
    <2fb>   DW_AT_name        : (indirect string, offset: 0x8a60d): motors
    <2ff>   DW_AT_decl_file   : 6
    <300>   DW_AT_decl_line   : 28
    <301>   DW_AT_decl_column : 4
    <302>   DW_AT_type        : <0x308>
    <306>   DW_AT_data_member_location: 0
 <2><307>: Abbrev Number: 0
 <1><308>: Abbrev Number: 9 (DW_TAG_array_type)
    <309>   DW_AT_type        : <0x2bc>
    <30d>   DW_AT_sibling     : <0x318>
 <2><311>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <312>   DW_AT_type        : <0x169>
    <316>   DW_AT_upper_bound : 1
 <2><317>: Abbrev Number: 0
 <1><318>: Abbrev Number: 3 (DW_TAG_typedef)
    <319>   DW_AT_name        : (indirect string, offset: 0x86e5e): motorControl_t
    <31d>   DW_AT_decl_file   : 6
    <31e>   DW_AT_decl_line   : 29
    <31f>   DW_AT_decl_column : 3
    <320>   DW_AT_type        : <0x2f1>
 <1><324>: Abbrev Number: 2 (DW_TAG_base_type)
    <325>   DW_AT_byte_size   : 1
    <326>   DW_AT_encoding    : 8	(unsigned char)
    <327>   DW_AT_name        : (indirect string, offset: 0x87840): char
 <1><32b>: Abbrev Number: 12 (DW_TAG_enumeration_type)
    <32c>   DW_AT_encoding    : 5	(signed)
    <32d>   DW_AT_byte_size   : 4
    <32e>   DW_AT_type        : <0x162>
    <332>   DW_AT_decl_file   : 7
    <333>   DW_AT_decl_line   : 176
    <334>   DW_AT_decl_column : 14
    <335>   DW_AT_sibling     : <0x36d>
 <2><339>: Abbrev Number: 13 (DW_TAG_enumerator)
    <33a>   DW_AT_name        : (indirect string, offset: 0x8a303): osOK
    <33e>   DW_AT_const_value : 0
 <2><33f>: Abbrev Number: 18 (DW_TAG_enumerator)
    <340>   DW_AT_name        : (indirect string, offset: 0x882e9): osError
    <344>   DW_AT_const_value : -1
 <2><345>: Abbrev Number: 18 (DW_TAG_enumerator)
    <346>   DW_AT_name        : (indirect string, offset: 0x86a31): osErrorTimeout
    <34a>   DW_AT_const_value : -2
 <2><34b>: Abbrev Number: 18 (DW_TAG_enumerator)
    <34c>   DW_AT_name        : (indirect string, offset: 0x89159): osErrorResource
    <350>   DW_AT_const_value : -3
 <2><351>: Abbrev Number: 18 (DW_TAG_enumerator)
    <352>   DW_AT_name        : (indirect string, offset: 0x8743f): osErrorParameter
    <356>   DW_AT_const_value : -4
 <2><357>: Abbrev Number: 18 (DW_TAG_enumerator)
    <358>   DW_AT_name        : (indirect string, offset: 0x86ece): osErrorNoMemory
    <35c>   DW_AT_const_value : -5
 <2><35d>: Abbrev Number: 18 (DW_TAG_enumerator)
    <35e>   DW_AT_name        : (indirect string, offset: 0x874f9): osErrorISR
    <362>   DW_AT_const_value : -6
 <2><363>: Abbrev Number: 19 (DW_TAG_enumerator)
    <364>   DW_AT_name        : (indirect string, offset: 0x88608): osStatusReserved
    <368>   DW_AT_const_value : 0x7fffffff
 <2><36c>: Abbrev Number: 0
 <1><36d>: Abbrev Number: 3 (DW_TAG_typedef)
    <36e>   DW_AT_name        : (indirect string, offset: 0x87926): osStatus_t
    <372>   DW_AT_decl_file   : 7
    <373>   DW_AT_decl_line   : 185
    <374>   DW_AT_decl_column : 3
    <375>   DW_AT_type        : <0x32b>
 <1><379>: Abbrev Number: 3 (DW_TAG_typedef)
    <37a>   DW_AT_name        : (indirect string, offset: 0x88255): osMessageQueueId_t
    <37e>   DW_AT_decl_file   : 7
    <37f>   DW_AT_decl_line   : 207
    <380>   DW_AT_decl_column : 15
    <381>   DW_AT_type        : <0x272>
 <1><385>: Abbrev Number: 20 (DW_TAG_pointer_type)
    <386>   DW_AT_byte_size   : 4
    <387>   DW_AT_type        : <0x38b>
 <1><38b>: Abbrev Number: 21 (DW_TAG_const_type)
 <1><38c>: Abbrev Number: 22 (DW_TAG_variable)
    <38d>   DW_AT_name        : (indirect string, offset: 0x89aba): motorQueueHandle
    <391>   DW_AT_decl_file   : 1
    <392>   DW_AT_decl_line   : 15
    <393>   DW_AT_decl_column : 27
    <394>   DW_AT_type        : <0x379>
    <398>   DW_AT_external    : 1
    <398>   DW_AT_declaration : 1
 <1><398>: Abbrev Number: 23 (DW_TAG_subprogram)
    <399>   DW_AT_external    : 1
    <399>   DW_AT_name        : (indirect string, offset: 0x86f36): HAL_GPIO_WritePin
    <39d>   DW_AT_decl_file   : 5
    <39e>   DW_AT_decl_line   : 235
    <39f>   DW_AT_decl_column : 6
    <3a0>   DW_AT_prototyped  : 1
    <3a0>   DW_AT_declaration : 1
    <3a0>   DW_AT_sibling     : <0x3b4>
 <2><3a4>: Abbrev Number: 24 (DW_TAG_formal_parameter)
    <3a5>   DW_AT_type        : <0x3b4>
 <2><3a9>: Abbrev Number: 24 (DW_TAG_formal_parameter)
    <3aa>   DW_AT_type        : <0x17c>
 <2><3ae>: Abbrev Number: 24 (DW_TAG_formal_parameter)
    <3af>   DW_AT_type        : <0x266>
 <2><3b3>: Abbrev Number: 0
 <1><3b4>: Abbrev Number: 20 (DW_TAG_pointer_type)
    <3b5>   DW_AT_byte_size   : 4
    <3b6>   DW_AT_type        : <0x237>
 <1><3ba>: Abbrev Number: 23 (DW_TAG_subprogram)
    <3bb>   DW_AT_external    : 1
    <3bb>   DW_AT_name        : (indirect string, offset: 0x89083): Motor2_SetSpeed
    <3bf>   DW_AT_decl_file   : 8
    <3c0>   DW_AT_decl_line   : 56
    <3c1>   DW_AT_decl_column : 6
    <3c2>   DW_AT_prototyped  : 1
    <3c2>   DW_AT_declaration : 1
    <3c2>   DW_AT_sibling     : <0x3cc>
 <2><3c6>: Abbrev Number: 24 (DW_TAG_formal_parameter)
    <3c7>   DW_AT_type        : <0x3cc>
 <2><3cb>: Abbrev Number: 0
 <1><3cc>: Abbrev Number: 2 (DW_TAG_base_type)
    <3cd>   DW_AT_byte_size   : 8
    <3ce>   DW_AT_encoding    : 4	(float)
    <3cf>   DW_AT_name        : (indirect string, offset: 0x8688c): double
 <1><3d3>: Abbrev Number: 23 (DW_TAG_subprogram)
    <3d4>   DW_AT_external    : 1
    <3d4>   DW_AT_name        : (indirect string, offset: 0x89253): Motor1_SetSpeed
    <3d8>   DW_AT_decl_file   : 8
    <3d9>   DW_AT_decl_line   : 55
    <3da>   DW_AT_decl_column : 6
    <3db>   DW_AT_prototyped  : 1
    <3db>   DW_AT_declaration : 1
    <3db>   DW_AT_sibling     : <0x3e5>
 <2><3df>: Abbrev Number: 24 (DW_TAG_formal_parameter)
    <3e0>   DW_AT_type        : <0x3cc>
 <2><3e4>: Abbrev Number: 0
 <1><3e5>: Abbrev Number: 25 (DW_TAG_subprogram)
    <3e6>   DW_AT_external    : 1
    <3e6>   DW_AT_name        : (indirect string, offset: 0x89541): osMessageQueuePut
    <3ea>   DW_AT_decl_file   : 7
    <3eb>   DW_AT_decl_line   : 689
    <3ed>   DW_AT_decl_column : 12
    <3ee>   DW_AT_prototyped  : 1
    <3ee>   DW_AT_type        : <0x36d>
    <3f2>   DW_AT_declaration : 1
    <3f2>   DW_AT_sibling     : <0x40b>
 <2><3f6>: Abbrev Number: 24 (DW_TAG_formal_parameter)
    <3f7>   DW_AT_type        : <0x379>
 <2><3fb>: Abbrev Number: 24 (DW_TAG_formal_parameter)
    <3fc>   DW_AT_type        : <0x385>
 <2><400>: Abbrev Number: 24 (DW_TAG_formal_parameter)
    <401>   DW_AT_type        : <0x170>
 <2><405>: Abbrev Number: 24 (DW_TAG_formal_parameter)
    <406>   DW_AT_type        : <0x188>
 <2><40a>: Abbrev Number: 0
 <1><40b>: Abbrev Number: 26 (DW_TAG_subprogram)
    <40c>   DW_AT_external    : 1
    <40c>   DW_AT_name        : (indirect string, offset: 0x89553): DCMotor_handleRequest
    <410>   DW_AT_decl_file   : 1
    <411>   DW_AT_decl_line   : 96
    <412>   DW_AT_decl_column : 6
    <413>   DW_AT_prototyped  : 1
    <413>   DW_AT_low_pc      : 0x8001158
    <417>   DW_AT_high_pc     : 0x170
    <41b>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <41d>   DW_AT_GNU_all_tail_call_sites: 1
    <41d>   DW_AT_sibling     : <0x48e>
 <2><421>: Abbrev Number: 27 (DW_TAG_formal_parameter)
    <422>   DW_AT_name        : (indirect string, offset: 0x88d2a): motorRequest
    <426>   DW_AT_decl_file   : 1
    <427>   DW_AT_decl_line   : 96
    <428>   DW_AT_decl_column : 44
    <429>   DW_AT_type        : <0x48e>
    <42d>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><430>: Abbrev Number: 28 (DW_TAG_lexical_block)
    <431>   DW_AT_low_pc      : 0x8001160
    <435>   DW_AT_high_pc     : 0x154
 <3><439>: Abbrev Number: 29 (DW_TAG_variable)
    <43a>   DW_AT_name        : i
    <43c>   DW_AT_decl_file   : 1
    <43d>   DW_AT_decl_line   : 98
    <43e>   DW_AT_decl_column : 14
    <43f>   DW_AT_type        : <0x170>
    <443>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <3><446>: Abbrev Number: 28 (DW_TAG_lexical_block)
    <447>   DW_AT_low_pc      : 0x8001166
    <44b>   DW_AT_high_pc     : 0x140
 <4><44f>: Abbrev Number: 30 (DW_TAG_variable)
    <450>   DW_AT_name        : (indirect string, offset: 0x87607): INx1_pin
    <454>   DW_AT_decl_file   : 1
    <455>   DW_AT_decl_line   : 100
    <456>   DW_AT_decl_column : 13
    <457>   DW_AT_type        : <0x17c>
    <45b>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <4><45e>: Abbrev Number: 30 (DW_TAG_variable)
    <45f>   DW_AT_name        : (indirect string, offset: 0x88c9c): INx2_pin
    <463>   DW_AT_decl_file   : 1
    <464>   DW_AT_decl_line   : 100
    <465>   DW_AT_decl_column : 23
    <466>   DW_AT_type        : <0x17c>
    <46a>   DW_AT_location    : 2 byte block: 91 72 	(DW_OP_fbreg: -14)
 <4><46d>: Abbrev Number: 30 (DW_TAG_variable)
    <46e>   DW_AT_name        : (indirect string, offset: 0x8734a): INx1_port
    <472>   DW_AT_decl_file   : 1
    <473>   DW_AT_decl_line   : 101
    <474>   DW_AT_decl_column : 18
    <475>   DW_AT_type        : <0x3b4>
    <479>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <4><47c>: Abbrev Number: 30 (DW_TAG_variable)
    <47d>   DW_AT_name        : (indirect string, offset: 0x89249): INx2_port
    <481>   DW_AT_decl_file   : 1
    <482>   DW_AT_decl_line   : 101
    <483>   DW_AT_decl_column : 30
    <484>   DW_AT_type        : <0x3b4>
    <488>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <4><48b>: Abbrev Number: 0
 <3><48c>: Abbrev Number: 0
 <2><48d>: Abbrev Number: 0
 <1><48e>: Abbrev Number: 20 (DW_TAG_pointer_type)
    <48f>   DW_AT_byte_size   : 4
    <490>   DW_AT_type        : <0x318>
 <1><494>: Abbrev Number: 26 (DW_TAG_subprogram)
    <495>   DW_AT_external    : 1
    <495>   DW_AT_name        : (indirect string, offset: 0x89911): DCMotor_changeSpeed
    <499>   DW_AT_decl_file   : 1
    <49a>   DW_AT_decl_line   : 85
    <49b>   DW_AT_decl_column : 6
    <49c>   DW_AT_prototyped  : 1
    <49c>   DW_AT_low_pc      : 0x80010e4
    <4a0>   DW_AT_high_pc     : 0x74
    <4a4>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <4a6>   DW_AT_GNU_all_tail_call_sites: 1
    <4a6>   DW_AT_sibling     : <0x4e0>
 <2><4aa>: Abbrev Number: 27 (DW_TAG_formal_parameter)
    <4ab>   DW_AT_name        : (indirect string, offset: 0x8fc43): speed
    <4af>   DW_AT_decl_file   : 1
    <4b0>   DW_AT_decl_line   : 85
    <4b1>   DW_AT_decl_column : 34
    <4b2>   DW_AT_type        : <0x170>
    <4b6>   DW_AT_location    : 2 byte block: 91 6f 	(DW_OP_fbreg: -17)
 <2><4b9>: Abbrev Number: 30 (DW_TAG_variable)
    <4ba>   DW_AT_name        : (indirect string, offset: 0x8a794): payload
    <4be>   DW_AT_decl_file   : 1
    <4bf>   DW_AT_decl_line   : 87
    <4c0>   DW_AT_decl_column : 17
    <4c1>   DW_AT_type        : <0x318>
    <4c5>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><4c8>: Abbrev Number: 28 (DW_TAG_lexical_block)
    <4c9>   DW_AT_low_pc      : 0x80010f8
    <4cd>   DW_AT_high_pc     : 0x42
 <3><4d1>: Abbrev Number: 29 (DW_TAG_variable)
    <4d2>   DW_AT_name        : i
    <4d4>   DW_AT_decl_file   : 1
    <4d5>   DW_AT_decl_line   : 88
    <4d6>   DW_AT_decl_column : 14
    <4d7>   DW_AT_type        : <0x170>
    <4db>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <3><4de>: Abbrev Number: 0
 <2><4df>: Abbrev Number: 0
 <1><4e0>: Abbrev Number: 26 (DW_TAG_subprogram)
    <4e1>   DW_AT_external    : 1
    <4e1>   DW_AT_name        : (indirect string, offset: 0x87fa3): DCMotor_moveRight
    <4e5>   DW_AT_decl_file   : 1
    <4e6>   DW_AT_decl_line   : 67
    <4e7>   DW_AT_decl_column : 6
    <4e8>   DW_AT_prototyped  : 1
    <4e8>   DW_AT_low_pc      : 0x8001088
    <4ec>   DW_AT_high_pc     : 0x5c
    <4f0>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <4f2>   DW_AT_GNU_all_tail_call_sites: 1
    <4f2>   DW_AT_sibling     : <0x515>
 <2><4f6>: Abbrev Number: 27 (DW_TAG_formal_parameter)
    <4f7>   DW_AT_name        : (indirect string, offset: 0x8fc43): speed
    <4fb>   DW_AT_decl_file   : 1
    <4fc>   DW_AT_decl_line   : 67
    <4fd>   DW_AT_decl_column : 32
    <4fe>   DW_AT_type        : <0x170>
    <502>   DW_AT_location    : 2 byte block: 91 6f 	(DW_OP_fbreg: -17)
 <2><505>: Abbrev Number: 30 (DW_TAG_variable)
    <506>   DW_AT_name        : (indirect string, offset: 0x8a794): payload
    <50a>   DW_AT_decl_file   : 1
    <50b>   DW_AT_decl_line   : 69
    <50c>   DW_AT_decl_column : 17
    <50d>   DW_AT_type        : <0x318>
    <511>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><514>: Abbrev Number: 0
 <1><515>: Abbrev Number: 26 (DW_TAG_subprogram)
    <516>   DW_AT_external    : 1
    <516>   DW_AT_name        : (indirect string, offset: 0x8810f): DCMotor_moveLeft
    <51a>   DW_AT_decl_file   : 1
    <51b>   DW_AT_decl_line   : 53
    <51c>   DW_AT_decl_column : 6
    <51d>   DW_AT_prototyped  : 1
    <51d>   DW_AT_low_pc      : 0x800102c
    <521>   DW_AT_high_pc     : 0x5c
    <525>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <527>   DW_AT_GNU_all_tail_call_sites: 1
    <527>   DW_AT_sibling     : <0x54a>
 <2><52b>: Abbrev Number: 27 (DW_TAG_formal_parameter)
    <52c>   DW_AT_name        : (indirect string, offset: 0x8fc43): speed
    <530>   DW_AT_decl_file   : 1
    <531>   DW_AT_decl_line   : 53
    <532>   DW_AT_decl_column : 31
    <533>   DW_AT_type        : <0x170>
    <537>   DW_AT_location    : 2 byte block: 91 6f 	(DW_OP_fbreg: -17)
 <2><53a>: Abbrev Number: 30 (DW_TAG_variable)
    <53b>   DW_AT_name        : (indirect string, offset: 0x8a794): payload
    <53f>   DW_AT_decl_file   : 1
    <540>   DW_AT_decl_line   : 55
    <541>   DW_AT_decl_column : 17
    <542>   DW_AT_type        : <0x318>
    <546>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><549>: Abbrev Number: 0
 <1><54a>: Abbrev Number: 26 (DW_TAG_subprogram)
    <54b>   DW_AT_external    : 1
    <54b>   DW_AT_name        : (indirect string, offset: 0x89ba0): DCMotor_moveBackward
    <54f>   DW_AT_decl_file   : 1
    <550>   DW_AT_decl_line   : 41
    <551>   DW_AT_decl_column : 6
    <552>   DW_AT_prototyped  : 1
    <552>   DW_AT_low_pc      : 0x8000fa8
    <556>   DW_AT_high_pc     : 0x84
    <55a>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <55c>   DW_AT_GNU_all_tail_call_sites: 1
    <55c>   DW_AT_sibling     : <0x596>
 <2><560>: Abbrev Number: 27 (DW_TAG_formal_parameter)
    <561>   DW_AT_name        : (indirect string, offset: 0x8fc43): speed
    <565>   DW_AT_decl_file   : 1
    <566>   DW_AT_decl_line   : 41
    <567>   DW_AT_decl_column : 35
    <568>   DW_AT_type        : <0x170>
    <56c>   DW_AT_location    : 2 byte block: 91 6f 	(DW_OP_fbreg: -17)
 <2><56f>: Abbrev Number: 30 (DW_TAG_variable)
    <570>   DW_AT_name        : (indirect string, offset: 0x8a794): payload
    <574>   DW_AT_decl_file   : 1
    <575>   DW_AT_decl_line   : 43
    <576>   DW_AT_decl_column : 17
    <577>   DW_AT_type        : <0x318>
    <57b>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><57e>: Abbrev Number: 28 (DW_TAG_lexical_block)
    <57f>   DW_AT_low_pc      : 0x8000fbc
    <583>   DW_AT_high_pc     : 0x54
 <3><587>: Abbrev Number: 29 (DW_TAG_variable)
    <588>   DW_AT_name        : i
    <58a>   DW_AT_decl_file   : 1
    <58b>   DW_AT_decl_line   : 44
    <58c>   DW_AT_decl_column : 14
    <58d>   DW_AT_type        : <0x170>
    <591>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <3><594>: Abbrev Number: 0
 <2><595>: Abbrev Number: 0
 <1><596>: Abbrev Number: 26 (DW_TAG_subprogram)
    <597>   DW_AT_external    : 1
    <597>   DW_AT_name        : (indirect string, offset: 0x89f14): DCMotor_moveForward
    <59b>   DW_AT_decl_file   : 1
    <59c>   DW_AT_decl_line   : 29
    <59d>   DW_AT_decl_column : 6
    <59e>   DW_AT_prototyped  : 1
    <59e>   DW_AT_low_pc      : 0x8000f24
    <5a2>   DW_AT_high_pc     : 0x84
    <5a6>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <5a8>   DW_AT_GNU_all_tail_call_sites: 1
    <5a8>   DW_AT_sibling     : <0x5e2>
 <2><5ac>: Abbrev Number: 27 (DW_TAG_formal_parameter)
    <5ad>   DW_AT_name        : (indirect string, offset: 0x8fc43): speed
    <5b1>   DW_AT_decl_file   : 1
    <5b2>   DW_AT_decl_line   : 29
    <5b3>   DW_AT_decl_column : 34
    <5b4>   DW_AT_type        : <0x170>
    <5b8>   DW_AT_location    : 2 byte block: 91 6f 	(DW_OP_fbreg: -17)
 <2><5bb>: Abbrev Number: 30 (DW_TAG_variable)
    <5bc>   DW_AT_name        : (indirect string, offset: 0x8a794): payload
    <5c0>   DW_AT_decl_file   : 1
    <5c1>   DW_AT_decl_line   : 31
    <5c2>   DW_AT_decl_column : 17
    <5c3>   DW_AT_type        : <0x318>
    <5c7>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><5ca>: Abbrev Number: 28 (DW_TAG_lexical_block)
    <5cb>   DW_AT_low_pc      : 0x8000f38
    <5cf>   DW_AT_high_pc     : 0x54
 <3><5d3>: Abbrev Number: 29 (DW_TAG_variable)
    <5d4>   DW_AT_name        : i
    <5d6>   DW_AT_decl_file   : 1
    <5d7>   DW_AT_decl_line   : 32
    <5d8>   DW_AT_decl_column : 14
    <5d9>   DW_AT_type        : <0x170>
    <5dd>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <3><5e0>: Abbrev Number: 0
 <2><5e1>: Abbrev Number: 0
 <1><5e2>: Abbrev Number: 31 (DW_TAG_subprogram)
    <5e3>   DW_AT_external    : 1
    <5e3>   DW_AT_name        : (indirect string, offset: 0x8a027): DCMotor_stop
    <5e7>   DW_AT_decl_file   : 1
    <5e8>   DW_AT_decl_line   : 17
    <5e9>   DW_AT_decl_column : 6
    <5ea>   DW_AT_prototyped  : 1
    <5ea>   DW_AT_low_pc      : 0x8000eb4
    <5ee>   DW_AT_high_pc     : 0x70
    <5f2>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <5f4>   DW_AT_GNU_all_tail_call_sites: 1
 <2><5f4>: Abbrev Number: 30 (DW_TAG_variable)
    <5f5>   DW_AT_name        : (indirect string, offset: 0x8a794): payload
    <5f9>   DW_AT_decl_file   : 1
    <5fa>   DW_AT_decl_line   : 19
    <5fb>   DW_AT_decl_column : 17
    <5fc>   DW_AT_type        : <0x318>
    <600>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><603>: Abbrev Number: 28 (DW_TAG_lexical_block)
    <604>   DW_AT_low_pc      : 0x8000ec2
    <608>   DW_AT_high_pc     : 0x48
 <3><60c>: Abbrev Number: 29 (DW_TAG_variable)
    <60d>   DW_AT_name        : i
    <60f>   DW_AT_decl_file   : 1
    <610>   DW_AT_decl_line   : 20
    <611>   DW_AT_decl_column : 14
    <612>   DW_AT_type        : <0x170>
    <616>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <3><619>: Abbrev Number: 0
 <2><61a>: Abbrev Number: 0
 <1><61b>: Abbrev Number: 0
  Compilation Unit @ offset 0x61c:
   Length:        0x10b3 (32-bit)
   Version:       4
   Abbrev Offset: 0x24a
   Pointer Size:  4
 <0><627>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <628>   DW_AT_producer    : (indirect string, offset: 0x69eb2): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <62c>   DW_AT_language    : 12	(ANSI C99)
    <62d>   DW_AT_name        : (indirect string, offset: 0x8b0de): ../Core/HCSR04/HCSR04.c
    <631>   DW_AT_comp_dir    : (indirect string, offset: 0x83fa7): D:/STM32CubeIDE/workspace_1.12.0/ADAS/NTI_RTOS_MOTOR_USART_SELF_UPDATED_GP/Debug
    <635>   DW_AT_ranges      : 0x50
    <639>   DW_AT_low_pc      : 0x0
    <63d>   DW_AT_stmt_list   : 0x11fd
    <641>   DW_AT_GNU_macros  : 0x150ec
 <1><645>: Abbrev Number: 2 (DW_TAG_base_type)
    <646>   DW_AT_byte_size   : 1
    <647>   DW_AT_encoding    : 6	(signed char)
    <648>   DW_AT_name        : (indirect string, offset: 0x645bf): signed char
 <1><64c>: Abbrev Number: 3 (DW_TAG_typedef)
    <64d>   DW_AT_name        : (indirect string, offset: 0x812a): __uint8_t
    <651>   DW_AT_decl_file   : 3
    <652>   DW_AT_decl_line   : 43
    <653>   DW_AT_decl_column : 24
    <654>   DW_AT_type        : <0x658>
 <1><658>: Abbrev Number: 2 (DW_TAG_base_type)
    <659>   DW_AT_byte_size   : 1
    <65a>   DW_AT_encoding    : 8	(unsigned char)
    <65b>   DW_AT_name        : (indirect string, offset: 0x60862): unsigned char
 <1><65f>: Abbrev Number: 2 (DW_TAG_base_type)
    <660>   DW_AT_byte_size   : 2
    <661>   DW_AT_encoding    : 5	(signed)
    <662>   DW_AT_name        : (indirect string, offset: 0x51e6): short int
 <1><666>: Abbrev Number: 3 (DW_TAG_typedef)
    <667>   DW_AT_name        : (indirect string, offset: 0x89d53): __uint16_t
    <66b>   DW_AT_decl_file   : 3
    <66c>   DW_AT_decl_line   : 57
    <66d>   DW_AT_decl_column : 25
    <66e>   DW_AT_type        : <0x672>
 <1><672>: Abbrev Number: 2 (DW_TAG_base_type)
    <673>   DW_AT_byte_size   : 2
    <674>   DW_AT_encoding    : 7	(unsigned)
    <675>   DW_AT_name        : (indirect string, offset: 0x43ab1): short unsigned int
 <1><679>: Abbrev Number: 2 (DW_TAG_base_type)
    <67a>   DW_AT_byte_size   : 4
    <67b>   DW_AT_encoding    : 5	(signed)
    <67c>   DW_AT_name        : (indirect string, offset: 0x1adbd): long int
 <1><680>: Abbrev Number: 3 (DW_TAG_typedef)
    <681>   DW_AT_name        : (indirect string, offset: 0x88fe3): __uint32_t
    <685>   DW_AT_decl_file   : 3
    <686>   DW_AT_decl_line   : 79
    <687>   DW_AT_decl_column : 25
    <688>   DW_AT_type        : <0x68c>
 <1><68c>: Abbrev Number: 2 (DW_TAG_base_type)
    <68d>   DW_AT_byte_size   : 4
    <68e>   DW_AT_encoding    : 7	(unsigned)
    <68f>   DW_AT_name        : (indirect string, offset: 0x4f275): long unsigned int
 <1><693>: Abbrev Number: 2 (DW_TAG_base_type)
    <694>   DW_AT_byte_size   : 8
    <695>   DW_AT_encoding    : 5	(signed)
    <696>   DW_AT_name        : (indirect string, offset: 0x35c83): long long int
 <1><69a>: Abbrev Number: 2 (DW_TAG_base_type)
    <69b>   DW_AT_byte_size   : 8
    <69c>   DW_AT_encoding    : 7	(unsigned)
    <69d>   DW_AT_name        : (indirect string, offset: 0x2e2ba): long long unsigned int
 <1><6a1>: Abbrev Number: 4 (DW_TAG_base_type)
    <6a2>   DW_AT_byte_size   : 4
    <6a3>   DW_AT_encoding    : 5	(signed)
    <6a4>   DW_AT_name        : int
 <1><6a8>: Abbrev Number: 2 (DW_TAG_base_type)
    <6a9>   DW_AT_byte_size   : 4
    <6aa>   DW_AT_encoding    : 7	(unsigned)
    <6ab>   DW_AT_name        : (indirect string, offset: 0x48b60): unsigned int
 <1><6af>: Abbrev Number: 3 (DW_TAG_typedef)
    <6b0>   DW_AT_name        : (indirect string, offset: 0x812c): uint8_t
    <6b4>   DW_AT_decl_file   : 4
    <6b5>   DW_AT_decl_line   : 24
    <6b6>   DW_AT_decl_column : 19
    <6b7>   DW_AT_type        : <0x64c>
 <1><6bb>: Abbrev Number: 3 (DW_TAG_typedef)
    <6bc>   DW_AT_name        : (indirect string, offset: 0x89656): uint16_t
    <6c0>   DW_AT_decl_file   : 4
    <6c1>   DW_AT_decl_line   : 36
    <6c2>   DW_AT_decl_column : 20
    <6c3>   DW_AT_type        : <0x666>
 <1><6c7>: Abbrev Number: 3 (DW_TAG_typedef)
    <6c8>   DW_AT_name        : (indirect string, offset: 0x89636): uint32_t
    <6cc>   DW_AT_decl_file   : 4
    <6cd>   DW_AT_decl_line   : 48
    <6ce>   DW_AT_decl_column : 20
    <6cf>   DW_AT_type        : <0x680>
 <1><6d3>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <6d4>   DW_AT_type        : <0x6c7>
 <1><6d8>: Abbrev Number: 6 (DW_TAG_const_type)
    <6d9>   DW_AT_type        : <0x6d3>
 <1><6dd>: Abbrev Number: 7 (DW_TAG_array_type)
    <6de>   DW_AT_type        : <0x6c7>
    <6e2>   DW_AT_sibling     : <0x6ed>
 <2><6e6>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <6e7>   DW_AT_type        : <0x6a8>
    <6eb>   DW_AT_upper_bound : 0
 <2><6ec>: Abbrev Number: 0
 <1><6ed>: Abbrev Number: 9 (DW_TAG_structure_type)
    <6ee>   DW_AT_byte_size   : 92
    <6ef>   DW_AT_decl_file   : 5
    <6f0>   DW_AT_decl_line   : 914
    <6f2>   DW_AT_decl_column : 9
    <6f3>   DW_AT_sibling     : <0x83a>
 <2><6f7>: Abbrev Number: 10 (DW_TAG_member)
    <6f8>   DW_AT_name        : (indirect string, offset: 0x8b152): CTRL
    <6fc>   DW_AT_decl_file   : 5
    <6fd>   DW_AT_decl_line   : 916
    <6ff>   DW_AT_decl_column : 18
    <700>   DW_AT_type        : <0x6d3>
    <704>   DW_AT_data_member_location: 0
 <2><705>: Abbrev Number: 10 (DW_TAG_member)
    <706>   DW_AT_name        : (indirect string, offset: 0x8b01e): CYCCNT
    <70a>   DW_AT_decl_file   : 5
    <70b>   DW_AT_decl_line   : 917
    <70d>   DW_AT_decl_column : 18
    <70e>   DW_AT_type        : <0x6d3>
    <712>   DW_AT_data_member_location: 4
 <2><713>: Abbrev Number: 10 (DW_TAG_member)
    <714>   DW_AT_name        : (indirect string, offset: 0x8ae1d): CPICNT
    <718>   DW_AT_decl_file   : 5
    <719>   DW_AT_decl_line   : 918
    <71b>   DW_AT_decl_column : 18
    <71c>   DW_AT_type        : <0x6d3>
    <720>   DW_AT_data_member_location: 8
 <2><721>: Abbrev Number: 10 (DW_TAG_member)
    <722>   DW_AT_name        : (indirect string, offset: 0x8b161): EXCCNT
    <726>   DW_AT_decl_file   : 5
    <727>   DW_AT_decl_line   : 919
    <729>   DW_AT_decl_column : 18
    <72a>   DW_AT_type        : <0x6d3>
    <72e>   DW_AT_data_member_location: 12
 <2><72f>: Abbrev Number: 10 (DW_TAG_member)
    <730>   DW_AT_name        : (indirect string, offset: 0x8b2ca): SLEEPCNT
    <734>   DW_AT_decl_file   : 5
    <735>   DW_AT_decl_line   : 920
    <737>   DW_AT_decl_column : 18
    <738>   DW_AT_type        : <0x6d3>
    <73c>   DW_AT_data_member_location: 16
 <2><73d>: Abbrev Number: 10 (DW_TAG_member)
    <73e>   DW_AT_name        : (indirect string, offset: 0x8b28f): LSUCNT
    <742>   DW_AT_decl_file   : 5
    <743>   DW_AT_decl_line   : 921
    <745>   DW_AT_decl_column : 18
    <746>   DW_AT_type        : <0x6d3>
    <74a>   DW_AT_data_member_location: 20
 <2><74b>: Abbrev Number: 10 (DW_TAG_member)
    <74c>   DW_AT_name        : (indirect string, offset: 0x8ad75): FOLDCNT
    <750>   DW_AT_decl_file   : 5
    <751>   DW_AT_decl_line   : 922
    <753>   DW_AT_decl_column : 18
    <754>   DW_AT_type        : <0x6d3>
    <758>   DW_AT_data_member_location: 24
 <2><759>: Abbrev Number: 10 (DW_TAG_member)
    <75a>   DW_AT_name        : (indirect string, offset: 0x8af51): PCSR
    <75e>   DW_AT_decl_file   : 5
    <75f>   DW_AT_decl_line   : 923
    <761>   DW_AT_decl_column : 18
    <762>   DW_AT_type        : <0x6d8>
    <766>   DW_AT_data_member_location: 28
 <2><767>: Abbrev Number: 10 (DW_TAG_member)
    <768>   DW_AT_name        : (indirect string, offset: 0x8b2d3): COMP0
    <76c>   DW_AT_decl_file   : 5
    <76d>   DW_AT_decl_line   : 924
    <76f>   DW_AT_decl_column : 18
    <770>   DW_AT_type        : <0x6d3>
    <774>   DW_AT_data_member_location: 32
 <2><775>: Abbrev Number: 10 (DW_TAG_member)
    <776>   DW_AT_name        : (indirect string, offset: 0x8b3a0): MASK0
    <77a>   DW_AT_decl_file   : 5
    <77b>   DW_AT_decl_line   : 925
    <77d>   DW_AT_decl_column : 18
    <77e>   DW_AT_type        : <0x6d3>
    <782>   DW_AT_data_member_location: 36
 <2><783>: Abbrev Number: 10 (DW_TAG_member)
    <784>   DW_AT_name        : (indirect string, offset: 0x8ac07): FUNCTION0
    <788>   DW_AT_decl_file   : 5
    <789>   DW_AT_decl_line   : 926
    <78b>   DW_AT_decl_column : 18
    <78c>   DW_AT_type        : <0x6d3>
    <790>   DW_AT_data_member_location: 40
 <2><791>: Abbrev Number: 10 (DW_TAG_member)
    <792>   DW_AT_name        : (indirect string, offset: 0x8ad57): RESERVED0
    <796>   DW_AT_decl_file   : 5
    <797>   DW_AT_decl_line   : 927
    <799>   DW_AT_decl_column : 18
    <79a>   DW_AT_type        : <0x6dd>
    <79e>   DW_AT_data_member_location: 44
 <2><79f>: Abbrev Number: 10 (DW_TAG_member)
    <7a0>   DW_AT_name        : (indirect string, offset: 0x4abbc): COMP1
    <7a4>   DW_AT_decl_file   : 5
    <7a5>   DW_AT_decl_line   : 928
    <7a7>   DW_AT_decl_column : 18
    <7a8>   DW_AT_type        : <0x6d3>
    <7ac>   DW_AT_data_member_location: 48
 <2><7ad>: Abbrev Number: 10 (DW_TAG_member)
    <7ae>   DW_AT_name        : (indirect string, offset: 0x8b3a6): MASK1
    <7b2>   DW_AT_decl_file   : 5
    <7b3>   DW_AT_decl_line   : 929
    <7b5>   DW_AT_decl_column : 18
    <7b6>   DW_AT_type        : <0x6d3>
    <7ba>   DW_AT_data_member_location: 52
 <2><7bb>: Abbrev Number: 10 (DW_TAG_member)
    <7bc>   DW_AT_name        : (indirect string, offset: 0x8ac11): FUNCTION1
    <7c0>   DW_AT_decl_file   : 5
    <7c1>   DW_AT_decl_line   : 930
    <7c3>   DW_AT_decl_column : 18
    <7c4>   DW_AT_type        : <0x6d3>
    <7c8>   DW_AT_data_member_location: 56
 <2><7c9>: Abbrev Number: 10 (DW_TAG_member)
    <7ca>   DW_AT_name        : (indirect string, offset: 0x8ad61): RESERVED1
    <7ce>   DW_AT_decl_file   : 5
    <7cf>   DW_AT_decl_line   : 931
    <7d1>   DW_AT_decl_column : 18
    <7d2>   DW_AT_type        : <0x6dd>
    <7d6>   DW_AT_data_member_location: 60
 <2><7d7>: Abbrev Number: 10 (DW_TAG_member)
    <7d8>   DW_AT_name        : (indirect string, offset: 0x4f356): COMP2
    <7dc>   DW_AT_decl_file   : 5
    <7dd>   DW_AT_decl_line   : 932
    <7df>   DW_AT_decl_column : 18
    <7e0>   DW_AT_type        : <0x6d3>
    <7e4>   DW_AT_data_member_location: 64
 <2><7e5>: Abbrev Number: 10 (DW_TAG_member)
    <7e6>   DW_AT_name        : (indirect string, offset: 0x8b3ac): MASK2
    <7ea>   DW_AT_decl_file   : 5
    <7eb>   DW_AT_decl_line   : 933
    <7ed>   DW_AT_decl_column : 18
    <7ee>   DW_AT_type        : <0x6d3>
    <7f2>   DW_AT_data_member_location: 68
 <2><7f3>: Abbrev Number: 10 (DW_TAG_member)
    <7f4>   DW_AT_name        : (indirect string, offset: 0x8ac1b): FUNCTION2
    <7f8>   DW_AT_decl_file   : 5
    <7f9>   DW_AT_decl_line   : 934
    <7fb>   DW_AT_decl_column : 18
    <7fc>   DW_AT_type        : <0x6d3>
    <800>   DW_AT_data_member_location: 72
 <2><801>: Abbrev Number: 10 (DW_TAG_member)
    <802>   DW_AT_name        : (indirect string, offset: 0x8ad6b): RESERVED2
    <806>   DW_AT_decl_file   : 5
    <807>   DW_AT_decl_line   : 935
    <809>   DW_AT_decl_column : 18
    <80a>   DW_AT_type        : <0x6dd>
    <80e>   DW_AT_data_member_location: 76
 <2><80f>: Abbrev Number: 10 (DW_TAG_member)
    <810>   DW_AT_name        : (indirect string, offset: 0x52b34): COMP3
    <814>   DW_AT_decl_file   : 5
    <815>   DW_AT_decl_line   : 936
    <817>   DW_AT_decl_column : 18
    <818>   DW_AT_type        : <0x6d3>
    <81c>   DW_AT_data_member_location: 80
 <2><81d>: Abbrev Number: 10 (DW_TAG_member)
    <81e>   DW_AT_name        : (indirect string, offset: 0x8b3b2): MASK3
    <822>   DW_AT_decl_file   : 5
    <823>   DW_AT_decl_line   : 937
    <825>   DW_AT_decl_column : 18
    <826>   DW_AT_type        : <0x6d3>
    <82a>   DW_AT_data_member_location: 84
 <2><82b>: Abbrev Number: 10 (DW_TAG_member)
    <82c>   DW_AT_name        : (indirect string, offset: 0x8ac25): FUNCTION3
    <830>   DW_AT_decl_file   : 5
    <831>   DW_AT_decl_line   : 938
    <833>   DW_AT_decl_column : 18
    <834>   DW_AT_type        : <0x6d3>
    <838>   DW_AT_data_member_location: 88
 <2><839>: Abbrev Number: 0
 <1><83a>: Abbrev Number: 11 (DW_TAG_typedef)
    <83b>   DW_AT_name        : (indirect string, offset: 0x8b055): DWT_Type
    <83f>   DW_AT_decl_file   : 5
    <840>   DW_AT_decl_line   : 939
    <842>   DW_AT_decl_column : 3
    <843>   DW_AT_type        : <0x6ed>
 <1><847>: Abbrev Number: 7 (DW_TAG_array_type)
    <848>   DW_AT_type        : <0x6c7>
    <84c>   DW_AT_sibling     : <0x857>
 <2><850>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <851>   DW_AT_type        : <0x6a8>
    <855>   DW_AT_upper_bound : 1
 <2><856>: Abbrev Number: 0
 <1><857>: Abbrev Number: 9 (DW_TAG_structure_type)
    <858>   DW_AT_byte_size   : 16
    <859>   DW_AT_decl_file   : 5
    <85a>   DW_AT_decl_line   : 1425
    <85c>   DW_AT_decl_column : 9
    <85d>   DW_AT_sibling     : <0x89a>
 <2><861>: Abbrev Number: 10 (DW_TAG_member)
    <862>   DW_AT_name        : (indirect string, offset: 0x8b1f9): DHCSR
    <866>   DW_AT_decl_file   : 5
    <867>   DW_AT_decl_line   : 1427
    <869>   DW_AT_decl_column : 18
    <86a>   DW_AT_type        : <0x6d3>
    <86e>   DW_AT_data_member_location: 0
 <2><86f>: Abbrev Number: 10 (DW_TAG_member)
    <870>   DW_AT_name        : (indirect string, offset: 0x8b4f0): DCRSR
    <874>   DW_AT_decl_file   : 5
    <875>   DW_AT_decl_line   : 1428
    <877>   DW_AT_decl_column : 18
    <878>   DW_AT_type        : <0x6d3>
    <87c>   DW_AT_data_member_location: 4
 <2><87d>: Abbrev Number: 10 (DW_TAG_member)
    <87e>   DW_AT_name        : (indirect string, offset: 0x8b4d8): DCRDR
    <882>   DW_AT_decl_file   : 5
    <883>   DW_AT_decl_line   : 1429
    <885>   DW_AT_decl_column : 18
    <886>   DW_AT_type        : <0x6d3>
    <88a>   DW_AT_data_member_location: 8
 <2><88b>: Abbrev Number: 10 (DW_TAG_member)
    <88c>   DW_AT_name        : (indirect string, offset: 0x8adff): DEMCR
    <890>   DW_AT_decl_file   : 5
    <891>   DW_AT_decl_line   : 1430
    <893>   DW_AT_decl_column : 18
    <894>   DW_AT_type        : <0x6d3>
    <898>   DW_AT_data_member_location: 12
 <2><899>: Abbrev Number: 0
 <1><89a>: Abbrev Number: 11 (DW_TAG_typedef)
    <89b>   DW_AT_name        : (indirect string, offset: 0x8afc2): CoreDebug_Type
    <89f>   DW_AT_decl_file   : 5
    <8a0>   DW_AT_decl_line   : 1431
    <8a2>   DW_AT_decl_column : 3
    <8a3>   DW_AT_type        : <0x857>
 <1><8a7>: Abbrev Number: 12 (DW_TAG_structure_type)
    <8a8>   DW_AT_byte_size   : 24
    <8a9>   DW_AT_decl_file   : 6
    <8aa>   DW_AT_decl_line   : 213
    <8ab>   DW_AT_decl_column : 9
    <8ac>   DW_AT_sibling     : <0x8fe>
 <2><8b0>: Abbrev Number: 13 (DW_TAG_member)
    <8b1>   DW_AT_name        : CR
    <8b4>   DW_AT_decl_file   : 6
    <8b5>   DW_AT_decl_line   : 215
    <8b6>   DW_AT_decl_column : 17
    <8b7>   DW_AT_type        : <0x6d3>
    <8bb>   DW_AT_data_member_location: 0
 <2><8bc>: Abbrev Number: 14 (DW_TAG_member)
    <8bd>   DW_AT_name        : (indirect string, offset: 0x8b4a7): NDTR
    <8c1>   DW_AT_decl_file   : 6
    <8c2>   DW_AT_decl_line   : 216
    <8c3>   DW_AT_decl_column : 17
    <8c4>   DW_AT_type        : <0x6d3>
    <8c8>   DW_AT_data_member_location: 4
 <2><8c9>: Abbrev Number: 13 (DW_TAG_member)
    <8ca>   DW_AT_name        : PAR
    <8ce>   DW_AT_decl_file   : 6
    <8cf>   DW_AT_decl_line   : 217
    <8d0>   DW_AT_decl_column : 17
    <8d1>   DW_AT_type        : <0x6d3>
    <8d5>   DW_AT_data_member_location: 8
 <2><8d6>: Abbrev Number: 14 (DW_TAG_member)
    <8d7>   DW_AT_name        : (indirect string, offset: 0x8ac02): M0AR
    <8db>   DW_AT_decl_file   : 6
    <8dc>   DW_AT_decl_line   : 218
    <8dd>   DW_AT_decl_column : 17
    <8de>   DW_AT_type        : <0x6d3>
    <8e2>   DW_AT_data_member_location: 12
 <2><8e3>: Abbrev Number: 14 (DW_TAG_member)
    <8e4>   DW_AT_name        : (indirect string, offset: 0x8b51d): M1AR
    <8e8>   DW_AT_decl_file   : 6
    <8e9>   DW_AT_decl_line   : 219
    <8ea>   DW_AT_decl_column : 17
    <8eb>   DW_AT_type        : <0x6d3>
    <8ef>   DW_AT_data_member_location: 16
 <2><8f0>: Abbrev Number: 13 (DW_TAG_member)
    <8f1>   DW_AT_name        : FCR
    <8f5>   DW_AT_decl_file   : 6
    <8f6>   DW_AT_decl_line   : 220
    <8f7>   DW_AT_decl_column : 17
    <8f8>   DW_AT_type        : <0x6d3>
    <8fc>   DW_AT_data_member_location: 20
 <2><8fd>: Abbrev Number: 0
 <1><8fe>: Abbrev Number: 3 (DW_TAG_typedef)
    <8ff>   DW_AT_name        : (indirect string, offset: 0x8b45e): DMA_Stream_TypeDef
    <903>   DW_AT_decl_file   : 6
    <904>   DW_AT_decl_line   : 221
    <905>   DW_AT_decl_column : 3
    <906>   DW_AT_type        : <0x8a7>
 <1><90a>: Abbrev Number: 9 (DW_TAG_structure_type)
    <90b>   DW_AT_byte_size   : 40
    <90c>   DW_AT_decl_file   : 6
    <90d>   DW_AT_decl_line   : 264
    <90f>   DW_AT_decl_column : 9
    <910>   DW_AT_sibling     : <0x993>
 <2><914>: Abbrev Number: 10 (DW_TAG_member)
    <915>   DW_AT_name        : (indirect string, offset: 0x85fb4): MODER
    <919>   DW_AT_decl_file   : 6
    <91a>   DW_AT_decl_line   : 266
    <91c>   DW_AT_decl_column : 17
    <91d>   DW_AT_type        : <0x6d3>
    <921>   DW_AT_data_member_location: 0
 <2><922>: Abbrev Number: 10 (DW_TAG_member)
    <923>   DW_AT_name        : (indirect string, offset: 0x89b05): OTYPER
    <927>   DW_AT_decl_file   : 6
    <928>   DW_AT_decl_line   : 267
    <92a>   DW_AT_decl_column : 17
    <92b>   DW_AT_type        : <0x6d3>
    <92f>   DW_AT_data_member_location: 4
 <2><930>: Abbrev Number: 10 (DW_TAG_member)
    <931>   DW_AT_name        : (indirect string, offset: 0x8a2c1): OSPEEDR
    <935>   DW_AT_decl_file   : 6
    <936>   DW_AT_decl_line   : 268
    <938>   DW_AT_decl_column : 17
    <939>   DW_AT_type        : <0x6d3>
    <93d>   DW_AT_data_member_location: 8
 <2><93e>: Abbrev Number: 10 (DW_TAG_member)
    <93f>   DW_AT_name        : (indirect string, offset: 0x86f6e): PUPDR
    <943>   DW_AT_decl_file   : 6
    <944>   DW_AT_decl_line   : 269
    <946>   DW_AT_decl_column : 17
    <947>   DW_AT_type        : <0x6d3>
    <94b>   DW_AT_data_member_location: 12
 <2><94c>: Abbrev Number: 15 (DW_TAG_member)
    <94d>   DW_AT_name        : IDR
    <951>   DW_AT_decl_file   : 6
    <952>   DW_AT_decl_line   : 270
    <954>   DW_AT_decl_column : 17
    <955>   DW_AT_type        : <0x6d3>
    <959>   DW_AT_data_member_location: 16
 <2><95a>: Abbrev Number: 15 (DW_TAG_member)
    <95b>   DW_AT_name        : ODR
    <95f>   DW_AT_decl_file   : 6
    <960>   DW_AT_decl_line   : 271
    <962>   DW_AT_decl_column : 17
    <963>   DW_AT_type        : <0x6d3>
    <967>   DW_AT_data_member_location: 20
 <2><968>: Abbrev Number: 10 (DW_TAG_member)
    <969>   DW_AT_name        : (indirect string, offset: 0x8738f): BSRR
    <96d>   DW_AT_decl_file   : 6
    <96e>   DW_AT_decl_line   : 272
    <970>   DW_AT_decl_column : 17
    <971>   DW_AT_type        : <0x6d3>
    <975>   DW_AT_data_member_location: 24
 <2><976>: Abbrev Number: 10 (DW_TAG_member)
    <977>   DW_AT_name        : (indirect string, offset: 0x8a0f8): LCKR
    <97b>   DW_AT_decl_file   : 6
    <97c>   DW_AT_decl_line   : 273
    <97e>   DW_AT_decl_column : 17
    <97f>   DW_AT_type        : <0x6d3>
    <983>   DW_AT_data_member_location: 28
 <2><984>: Abbrev Number: 15 (DW_TAG_member)
    <985>   DW_AT_name        : AFR
    <989>   DW_AT_decl_file   : 6
    <98a>   DW_AT_decl_line   : 274
    <98c>   DW_AT_decl_column : 17
    <98d>   DW_AT_type        : <0x9a3>
    <991>   DW_AT_data_member_location: 32
 <2><992>: Abbrev Number: 0
 <1><993>: Abbrev Number: 7 (DW_TAG_array_type)
    <994>   DW_AT_type        : <0x6d3>
    <998>   DW_AT_sibling     : <0x9a3>
 <2><99c>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <99d>   DW_AT_type        : <0x6a8>
    <9a1>   DW_AT_upper_bound : 1
 <2><9a2>: Abbrev Number: 0
 <1><9a3>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <9a4>   DW_AT_type        : <0x993>
 <1><9a8>: Abbrev Number: 11 (DW_TAG_typedef)
    <9a9>   DW_AT_name        : (indirect string, offset: 0x8a973): GPIO_TypeDef
    <9ad>   DW_AT_decl_file   : 6
    <9ae>   DW_AT_decl_line   : 275
    <9b0>   DW_AT_decl_column : 3
    <9b1>   DW_AT_type        : <0x90a>
 <1><9b5>: Abbrev Number: 9 (DW_TAG_structure_type)
    <9b6>   DW_AT_byte_size   : 144
    <9b7>   DW_AT_decl_file   : 6
    <9b8>   DW_AT_decl_line   : 335
    <9ba>   DW_AT_decl_column : 9
    <9bb>   DW_AT_sibling     : <0xb7f>
 <2><9bf>: Abbrev Number: 15 (DW_TAG_member)
    <9c0>   DW_AT_name        : CR
    <9c3>   DW_AT_decl_file   : 6
    <9c4>   DW_AT_decl_line   : 337
    <9c6>   DW_AT_decl_column : 17
    <9c7>   DW_AT_type        : <0x6d3>
    <9cb>   DW_AT_data_member_location: 0
 <2><9cc>: Abbrev Number: 10 (DW_TAG_member)
    <9cd>   DW_AT_name        : (indirect string, offset: 0x8afba): PLLCFGR
    <9d1>   DW_AT_decl_file   : 6
    <9d2>   DW_AT_decl_line   : 338
    <9d4>   DW_AT_decl_column : 17
    <9d5>   DW_AT_type        : <0x6d3>
    <9d9>   DW_AT_data_member_location: 4
 <2><9da>: Abbrev Number: 10 (DW_TAG_member)
    <9db>   DW_AT_name        : (indirect string, offset: 0x8b30a): CFGR
    <9df>   DW_AT_decl_file   : 6
    <9e0>   DW_AT_decl_line   : 339
    <9e2>   DW_AT_decl_column : 17
    <9e3>   DW_AT_type        : <0x6d3>
    <9e7>   DW_AT_data_member_location: 8
 <2><9e8>: Abbrev Number: 15 (DW_TAG_member)
    <9e9>   DW_AT_name        : CIR
    <9ed>   DW_AT_decl_file   : 6
    <9ee>   DW_AT_decl_line   : 340
    <9f0>   DW_AT_decl_column : 17
    <9f1>   DW_AT_type        : <0x6d3>
    <9f5>   DW_AT_data_member_location: 12
 <2><9f6>: Abbrev Number: 10 (DW_TAG_member)
    <9f7>   DW_AT_name        : (indirect string, offset: 0x8b237): AHB1RSTR
    <9fb>   DW_AT_decl_file   : 6
    <9fc>   DW_AT_decl_line   : 341
    <9fe>   DW_AT_decl_column : 17
    <9ff>   DW_AT_type        : <0x6d3>
    <a03>   DW_AT_data_member_location: 16
 <2><a04>: Abbrev Number: 10 (DW_TAG_member)
    <a05>   DW_AT_name        : (indirect string, offset: 0x8b370): AHB2RSTR
    <a09>   DW_AT_decl_file   : 6
    <a0a>   DW_AT_decl_line   : 342
    <a0c>   DW_AT_decl_column : 17
    <a0d>   DW_AT_type        : <0x6d3>
    <a11>   DW_AT_data_member_location: 20
 <2><a12>: Abbrev Number: 10 (DW_TAG_member)
    <a13>   DW_AT_name        : (indirect string, offset: 0x8b514): AHB3RSTR
    <a17>   DW_AT_decl_file   : 6
    <a18>   DW_AT_decl_line   : 343
    <a1a>   DW_AT_decl_column : 17
    <a1b>   DW_AT_type        : <0x6d3>
    <a1f>   DW_AT_data_member_location: 24
 <2><a20>: Abbrev Number: 10 (DW_TAG_member)
    <a21>   DW_AT_name        : (indirect string, offset: 0x8ad57): RESERVED0
    <a25>   DW_AT_decl_file   : 6
    <a26>   DW_AT_decl_line   : 344
    <a28>   DW_AT_decl_column : 17
    <a29>   DW_AT_type        : <0x6c7>
    <a2d>   DW_AT_data_member_location: 28
 <2><a2e>: Abbrev Number: 10 (DW_TAG_member)
    <a2f>   DW_AT_name        : (indirect string, offset: 0x8adc8): APB1RSTR
    <a33>   DW_AT_decl_file   : 6
    <a34>   DW_AT_decl_line   : 345
    <a36>   DW_AT_decl_column : 17
    <a37>   DW_AT_type        : <0x6d3>
    <a3b>   DW_AT_data_member_location: 32
 <2><a3c>: Abbrev Number: 10 (DW_TAG_member)
    <a3d>   DW_AT_name        : (indirect string, offset: 0x8ad17): APB2RSTR
    <a41>   DW_AT_decl_file   : 6
    <a42>   DW_AT_decl_line   : 346
    <a44>   DW_AT_decl_column : 17
    <a45>   DW_AT_type        : <0x6d3>
    <a49>   DW_AT_data_member_location: 36
 <2><a4a>: Abbrev Number: 10 (DW_TAG_member)
    <a4b>   DW_AT_name        : (indirect string, offset: 0x8ad61): RESERVED1
    <a4f>   DW_AT_decl_file   : 6
    <a50>   DW_AT_decl_line   : 347
    <a52>   DW_AT_decl_column : 17
    <a53>   DW_AT_type        : <0x847>
    <a57>   DW_AT_data_member_location: 40
 <2><a58>: Abbrev Number: 10 (DW_TAG_member)
    <a59>   DW_AT_name        : (indirect string, offset: 0x8b344): AHB1ENR
    <a5d>   DW_AT_decl_file   : 6
    <a5e>   DW_AT_decl_line   : 348
    <a60>   DW_AT_decl_column : 17
    <a61>   DW_AT_type        : <0x6d3>
    <a65>   DW_AT_data_member_location: 48
 <2><a66>: Abbrev Number: 10 (DW_TAG_member)
    <a67>   DW_AT_name        : (indirect string, offset: 0x8ad92): AHB2ENR
    <a6b>   DW_AT_decl_file   : 6
    <a6c>   DW_AT_decl_line   : 349
    <a6e>   DW_AT_decl_column : 17
    <a6f>   DW_AT_type        : <0x6d3>
    <a73>   DW_AT_data_member_location: 52
 <2><a74>: Abbrev Number: 10 (DW_TAG_member)
    <a75>   DW_AT_name        : (indirect string, offset: 0x8abeb): AHB3ENR
    <a79>   DW_AT_decl_file   : 6
    <a7a>   DW_AT_decl_line   : 350
    <a7c>   DW_AT_decl_column : 17
    <a7d>   DW_AT_type        : <0x6d3>
    <a81>   DW_AT_data_member_location: 56
 <2><a82>: Abbrev Number: 10 (DW_TAG_member)
    <a83>   DW_AT_name        : (indirect string, offset: 0x8ad6b): RESERVED2
    <a87>   DW_AT_decl_file   : 6
    <a88>   DW_AT_decl_line   : 351
    <a8a>   DW_AT_decl_column : 17
    <a8b>   DW_AT_type        : <0x6c7>
    <a8f>   DW_AT_data_member_location: 60
 <2><a90>: Abbrev Number: 10 (DW_TAG_member)
    <a91>   DW_AT_name        : (indirect string, offset: 0x8b251): APB1ENR
    <a95>   DW_AT_decl_file   : 6
    <a96>   DW_AT_decl_line   : 352
    <a98>   DW_AT_decl_column : 17
    <a99>   DW_AT_type        : <0x6d3>
    <a9d>   DW_AT_data_member_location: 64
 <2><a9e>: Abbrev Number: 10 (DW_TAG_member)
    <a9f>   DW_AT_name        : (indirect string, offset: 0x8b1c8): APB2ENR
    <aa3>   DW_AT_decl_file   : 6
    <aa4>   DW_AT_decl_line   : 353
    <aa6>   DW_AT_decl_column : 17
    <aa7>   DW_AT_type        : <0x6d3>
    <aab>   DW_AT_data_member_location: 68
 <2><aac>: Abbrev Number: 10 (DW_TAG_member)
    <aad>   DW_AT_name        : (indirect string, offset: 0x8b18f): RESERVED3
    <ab1>   DW_AT_decl_file   : 6
    <ab2>   DW_AT_decl_line   : 354
    <ab4>   DW_AT_decl_column : 17
    <ab5>   DW_AT_type        : <0x847>
    <ab9>   DW_AT_data_member_location: 72
 <2><aba>: Abbrev Number: 10 (DW_TAG_member)
    <abb>   DW_AT_name        : (indirect string, offset: 0x8ae2e): AHB1LPENR
    <abf>   DW_AT_decl_file   : 6
    <ac0>   DW_AT_decl_line   : 355
    <ac2>   DW_AT_decl_column : 17
    <ac3>   DW_AT_type        : <0x6d3>
    <ac7>   DW_AT_data_member_location: 80
 <2><ac8>: Abbrev Number: 10 (DW_TAG_member)
    <ac9>   DW_AT_name        : (indirect string, offset: 0x8b259): AHB2LPENR
    <acd>   DW_AT_decl_file   : 6
    <ace>   DW_AT_decl_line   : 356
    <ad0>   DW_AT_decl_column : 17
    <ad1>   DW_AT_type        : <0x6d3>
    <ad5>   DW_AT_data_member_location: 84
 <2><ad6>: Abbrev Number: 10 (DW_TAG_member)
    <ad7>   DW_AT_name        : (indirect string, offset: 0x8b30f): AHB3LPENR
    <adb>   DW_AT_decl_file   : 6
    <adc>   DW_AT_decl_line   : 357
    <ade>   DW_AT_decl_column : 17
    <adf>   DW_AT_type        : <0x6d3>
    <ae3>   DW_AT_data_member_location: 88
 <2><ae4>: Abbrev Number: 10 (DW_TAG_member)
    <ae5>   DW_AT_name        : (indirect string, offset: 0x8b199): RESERVED4
    <ae9>   DW_AT_decl_file   : 6
    <aea>   DW_AT_decl_line   : 358
    <aec>   DW_AT_decl_column : 17
    <aed>   DW_AT_type        : <0x6c7>
    <af1>   DW_AT_data_member_location: 92
 <2><af2>: Abbrev Number: 10 (DW_TAG_member)
    <af3>   DW_AT_name        : (indirect string, offset: 0x8b326): APB1LPENR
    <af7>   DW_AT_decl_file   : 6
    <af8>   DW_AT_decl_line   : 359
    <afa>   DW_AT_decl_column : 17
    <afb>   DW_AT_type        : <0x6d3>
    <aff>   DW_AT_data_member_location: 96
 <2><b00>: Abbrev Number: 10 (DW_TAG_member)
    <b01>   DW_AT_name        : (indirect string, offset: 0x8b522): APB2LPENR
    <b05>   DW_AT_decl_file   : 6
    <b06>   DW_AT_decl_line   : 360
    <b08>   DW_AT_decl_column : 17
    <b09>   DW_AT_type        : <0x6d3>
    <b0d>   DW_AT_data_member_location: 100
 <2><b0e>: Abbrev Number: 10 (DW_TAG_member)
    <b0f>   DW_AT_name        : (indirect string, offset: 0x8b1a3): RESERVED5
    <b13>   DW_AT_decl_file   : 6
    <b14>   DW_AT_decl_line   : 361
    <b16>   DW_AT_decl_column : 17
    <b17>   DW_AT_type        : <0x847>
    <b1b>   DW_AT_data_member_location: 104
 <2><b1c>: Abbrev Number: 10 (DW_TAG_member)
    <b1d>   DW_AT_name        : (indirect string, offset: 0x8b55f): BDCR
    <b21>   DW_AT_decl_file   : 6
    <b22>   DW_AT_decl_line   : 362
    <b24>   DW_AT_decl_column : 17
    <b25>   DW_AT_type        : <0x6d3>
    <b29>   DW_AT_data_member_location: 112
 <2><b2a>: Abbrev Number: 15 (DW_TAG_member)
    <b2b>   DW_AT_name        : CSR
    <b2f>   DW_AT_decl_file   : 6
    <b30>   DW_AT_decl_line   : 363
    <b32>   DW_AT_decl_column : 17
    <b33>   DW_AT_type        : <0x6d3>
    <b37>   DW_AT_data_member_location: 116
 <2><b38>: Abbrev Number: 10 (DW_TAG_member)
    <b39>   DW_AT_name        : (indirect string, offset: 0x8b11b): RESERVED6
    <b3d>   DW_AT_decl_file   : 6
    <b3e>   DW_AT_decl_line   : 364
    <b40>   DW_AT_decl_column : 17
    <b41>   DW_AT_type        : <0x847>
    <b45>   DW_AT_data_member_location: 120
 <2><b46>: Abbrev Number: 10 (DW_TAG_member)
    <b47>   DW_AT_name        : (indirect string, offset: 0x8b3b8): SSCGR
    <b4b>   DW_AT_decl_file   : 6
    <b4c>   DW_AT_decl_line   : 365
    <b4e>   DW_AT_decl_column : 17
    <b4f>   DW_AT_type        : <0x6d3>
    <b53>   DW_AT_data_member_location: 128
 <2><b54>: Abbrev Number: 10 (DW_TAG_member)
    <b55>   DW_AT_name        : (indirect string, offset: 0x8ad3e): PLLI2SCFGR
    <b59>   DW_AT_decl_file   : 6
    <b5a>   DW_AT_decl_line   : 366
    <b5c>   DW_AT_decl_column : 17
    <b5d>   DW_AT_type        : <0x6d3>
    <b61>   DW_AT_data_member_location: 132
 <2><b62>: Abbrev Number: 10 (DW_TAG_member)
    <b63>   DW_AT_name        : (indirect string, offset: 0x8b1ad): RESERVED7
    <b67>   DW_AT_decl_file   : 6
    <b68>   DW_AT_decl_line   : 367
    <b6a>   DW_AT_decl_column : 17
    <b6b>   DW_AT_type        : <0x6dd>
    <b6f>   DW_AT_data_member_location: 136
 <2><b70>: Abbrev Number: 10 (DW_TAG_member)
    <b71>   DW_AT_name        : (indirect string, offset: 0x8b307): DCKCFGR
    <b75>   DW_AT_decl_file   : 6
    <b76>   DW_AT_decl_line   : 368
    <b78>   DW_AT_decl_column : 17
    <b79>   DW_AT_type        : <0x6d3>
    <b7d>   DW_AT_data_member_location: 140
 <2><b7e>: Abbrev Number: 0
 <1><b7f>: Abbrev Number: 11 (DW_TAG_typedef)
    <b80>   DW_AT_name        : (indirect string, offset: 0x8ade0): RCC_TypeDef
    <b84>   DW_AT_decl_file   : 6
    <b85>   DW_AT_decl_line   : 369
    <b87>   DW_AT_decl_column : 3
    <b88>   DW_AT_type        : <0x9b5>
 <1><b8c>: Abbrev Number: 9 (DW_TAG_structure_type)
    <b8d>   DW_AT_byte_size   : 84
    <b8e>   DW_AT_decl_file   : 6
    <b8f>   DW_AT_decl_line   : 469
    <b91>   DW_AT_decl_column : 9
    <b92>   DW_AT_sibling     : <0xcbb>
 <2><b96>: Abbrev Number: 15 (DW_TAG_member)
    <b97>   DW_AT_name        : CR1
    <b9b>   DW_AT_decl_file   : 6
    <b9c>   DW_AT_decl_line   : 471
    <b9e>   DW_AT_decl_column : 17
    <b9f>   DW_AT_type        : <0x6d3>
    <ba3>   DW_AT_data_member_location: 0
 <2><ba4>: Abbrev Number: 15 (DW_TAG_member)
    <ba5>   DW_AT_name        : CR2
    <ba9>   DW_AT_decl_file   : 6
    <baa>   DW_AT_decl_line   : 472
    <bac>   DW_AT_decl_column : 17
    <bad>   DW_AT_type        : <0x6d3>
    <bb1>   DW_AT_data_member_location: 4
 <2><bb2>: Abbrev Number: 10 (DW_TAG_member)
    <bb3>   DW_AT_name        : (indirect string, offset: 0x81fad): SMCR
    <bb7>   DW_AT_decl_file   : 6
    <bb8>   DW_AT_decl_line   : 473
    <bba>   DW_AT_decl_column : 17
    <bbb>   DW_AT_type        : <0x6d3>
    <bbf>   DW_AT_data_member_location: 8
 <2><bc0>: Abbrev Number: 10 (DW_TAG_member)
    <bc1>   DW_AT_name        : (indirect string, offset: 0x615f3): DIER
    <bc5>   DW_AT_decl_file   : 6
    <bc6>   DW_AT_decl_line   : 474
    <bc8>   DW_AT_decl_column : 17
    <bc9>   DW_AT_type        : <0x6d3>
    <bcd>   DW_AT_data_member_location: 12
 <2><bce>: Abbrev Number: 15 (DW_TAG_member)
    <bcf>   DW_AT_name        : SR
    <bd2>   DW_AT_decl_file   : 6
    <bd3>   DW_AT_decl_line   : 475
    <bd5>   DW_AT_decl_column : 17
    <bd6>   DW_AT_type        : <0x6d3>
    <bda>   DW_AT_data_member_location: 16
 <2><bdb>: Abbrev Number: 15 (DW_TAG_member)
    <bdc>   DW_AT_name        : EGR
    <be0>   DW_AT_decl_file   : 6
    <be1>   DW_AT_decl_line   : 476
    <be3>   DW_AT_decl_column : 17
    <be4>   DW_AT_type        : <0x6d3>
    <be8>   DW_AT_data_member_location: 20
 <2><be9>: Abbrev Number: 10 (DW_TAG_member)
    <bea>   DW_AT_name        : (indirect string, offset: 0x559d2): CCMR1
    <bee>   DW_AT_decl_file   : 6
    <bef>   DW_AT_decl_line   : 477
    <bf1>   DW_AT_decl_column : 17
    <bf2>   DW_AT_type        : <0x6d3>
    <bf6>   DW_AT_data_member_location: 24
 <2><bf7>: Abbrev Number: 10 (DW_TAG_member)
    <bf8>   DW_AT_name        : (indirect string, offset: 0x5b37b): CCMR2
    <bfc>   DW_AT_decl_file   : 6
    <bfd>   DW_AT_decl_line   : 478
    <bff>   DW_AT_decl_column : 17
    <c00>   DW_AT_type        : <0x6d3>
    <c04>   DW_AT_data_member_location: 28
 <2><c05>: Abbrev Number: 10 (DW_TAG_member)
    <c06>   DW_AT_name        : (indirect string, offset: 0x803df): CCER
    <c0a>   DW_AT_decl_file   : 6
    <c0b>   DW_AT_decl_line   : 479
    <c0d>   DW_AT_decl_column : 17
    <c0e>   DW_AT_type        : <0x6d3>
    <c12>   DW_AT_data_member_location: 32
 <2><c13>: Abbrev Number: 15 (DW_TAG_member)
    <c14>   DW_AT_name        : CNT
    <c18>   DW_AT_decl_file   : 6
    <c19>   DW_AT_decl_line   : 480
    <c1b>   DW_AT_decl_column : 17
    <c1c>   DW_AT_type        : <0x6d3>
    <c20>   DW_AT_data_member_location: 36
 <2><c21>: Abbrev Number: 15 (DW_TAG_member)
    <c22>   DW_AT_name        : PSC
    <c26>   DW_AT_decl_file   : 6
    <c27>   DW_AT_decl_line   : 481
    <c29>   DW_AT_decl_column : 17
    <c2a>   DW_AT_type        : <0x6d3>
    <c2e>   DW_AT_data_member_location: 40
 <2><c2f>: Abbrev Number: 15 (DW_TAG_member)
    <c30>   DW_AT_name        : ARR
    <c34>   DW_AT_decl_file   : 6
    <c35>   DW_AT_decl_line   : 482
    <c37>   DW_AT_decl_column : 17
    <c38>   DW_AT_type        : <0x6d3>
    <c3c>   DW_AT_data_member_location: 44
 <2><c3d>: Abbrev Number: 15 (DW_TAG_member)
    <c3e>   DW_AT_name        : RCR
    <c42>   DW_AT_decl_file   : 6
    <c43>   DW_AT_decl_line   : 483
    <c45>   DW_AT_decl_column : 17
    <c46>   DW_AT_type        : <0x6d3>
    <c4a>   DW_AT_data_member_location: 48
 <2><c4b>: Abbrev Number: 10 (DW_TAG_member)
    <c4c>   DW_AT_name        : (indirect string, offset: 0x6e942): CCR1
    <c50>   DW_AT_decl_file   : 6
    <c51>   DW_AT_decl_line   : 484
    <c53>   DW_AT_decl_column : 17
    <c54>   DW_AT_type        : <0x6d3>
    <c58>   DW_AT_data_member_location: 52
 <2><c59>: Abbrev Number: 10 (DW_TAG_member)
    <c5a>   DW_AT_name        : (indirect string, offset: 0x3962a): CCR2
    <c5e>   DW_AT_decl_file   : 6
    <c5f>   DW_AT_decl_line   : 485
    <c61>   DW_AT_decl_column : 17
    <c62>   DW_AT_type        : <0x6d3>
    <c66>   DW_AT_data_member_location: 56
 <2><c67>: Abbrev Number: 10 (DW_TAG_member)
    <c68>   DW_AT_name        : (indirect string, offset: 0x35688): CCR3
    <c6c>   DW_AT_decl_file   : 6
    <c6d>   DW_AT_decl_line   : 486
    <c6f>   DW_AT_decl_column : 17
    <c70>   DW_AT_type        : <0x6d3>
    <c74>   DW_AT_data_member_location: 60
 <2><c75>: Abbrev Number: 10 (DW_TAG_member)
    <c76>   DW_AT_name        : (indirect string, offset: 0xf5a5): CCR4
    <c7a>   DW_AT_decl_file   : 6
    <c7b>   DW_AT_decl_line   : 487
    <c7d>   DW_AT_decl_column : 17
    <c7e>   DW_AT_type        : <0x6d3>
    <c82>   DW_AT_data_member_location: 64
 <2><c83>: Abbrev Number: 10 (DW_TAG_member)
    <c84>   DW_AT_name        : (indirect string, offset: 0xa402): BDTR
    <c88>   DW_AT_decl_file   : 6
    <c89>   DW_AT_decl_line   : 488
    <c8b>   DW_AT_decl_column : 17
    <c8c>   DW_AT_type        : <0x6d3>
    <c90>   DW_AT_data_member_location: 68
 <2><c91>: Abbrev Number: 15 (DW_TAG_member)
    <c92>   DW_AT_name        : DCR
    <c96>   DW_AT_decl_file   : 6
    <c97>   DW_AT_decl_line   : 489
    <c99>   DW_AT_decl_column : 17
    <c9a>   DW_AT_type        : <0x6d3>
    <c9e>   DW_AT_data_member_location: 72
 <2><c9f>: Abbrev Number: 10 (DW_TAG_member)
    <ca0>   DW_AT_name        : (indirect string, offset: 0x3c2f): DMAR
    <ca4>   DW_AT_decl_file   : 6
    <ca5>   DW_AT_decl_line   : 490
    <ca7>   DW_AT_decl_column : 17
    <ca8>   DW_AT_type        : <0x6d3>
    <cac>   DW_AT_data_member_location: 76
 <2><cad>: Abbrev Number: 15 (DW_TAG_member)
    <cae>   DW_AT_name        : OR
    <cb1>   DW_AT_decl_file   : 6
    <cb2>   DW_AT_decl_line   : 491
    <cb4>   DW_AT_decl_column : 17
    <cb5>   DW_AT_type        : <0x6d3>
    <cb9>   DW_AT_data_member_location: 80
 <2><cba>: Abbrev Number: 0
 <1><cbb>: Abbrev Number: 11 (DW_TAG_typedef)
    <cbc>   DW_AT_name        : (indirect string, offset: 0x8b0cd): TIM_TypeDef
    <cc0>   DW_AT_decl_file   : 6
    <cc1>   DW_AT_decl_line   : 492
    <cc3>   DW_AT_decl_column : 3
    <cc4>   DW_AT_type        : <0xb8c>
 <1><cc8>: Abbrev Number: 2 (DW_TAG_base_type)
    <cc9>   DW_AT_byte_size   : 8
    <cca>   DW_AT_encoding    : 4	(float)
    <ccb>   DW_AT_name        : (indirect string, offset: 0x8ee18): long double
 <1><ccf>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <cd0>   DW_AT_encoding    : 7	(unsigned)
    <cd1>   DW_AT_byte_size   : 1
    <cd2>   DW_AT_type        : <0x658>
    <cd6>   DW_AT_decl_file   : 7
    <cd7>   DW_AT_decl_line   : 39
    <cd8>   DW_AT_decl_column : 1
    <cd9>   DW_AT_sibling     : <0xcf6>
 <2><cdd>: Abbrev Number: 17 (DW_TAG_enumerator)
    <cde>   DW_AT_name        : (indirect string, offset: 0x8b240): HAL_OK
    <ce2>   DW_AT_const_value : 0
 <2><ce3>: Abbrev Number: 17 (DW_TAG_enumerator)
    <ce4>   DW_AT_name        : (indirect string, offset: 0x8b0ab): HAL_ERROR
    <ce8>   DW_AT_const_value : 1
 <2><ce9>: Abbrev Number: 17 (DW_TAG_enumerator)
    <cea>   DW_AT_name        : (indirect string, offset: 0x8ac93): HAL_BUSY
    <cee>   DW_AT_const_value : 2
 <2><cef>: Abbrev Number: 17 (DW_TAG_enumerator)
    <cf0>   DW_AT_name        : (indirect string, offset: 0x8b08b): HAL_TIMEOUT
    <cf4>   DW_AT_const_value : 3
 <2><cf5>: Abbrev Number: 0
 <1><cf6>: Abbrev Number: 3 (DW_TAG_typedef)
    <cf7>   DW_AT_name        : (indirect string, offset: 0x8b4ac): HAL_StatusTypeDef
    <cfb>   DW_AT_decl_file   : 7
    <cfc>   DW_AT_decl_line   : 44
    <cfd>   DW_AT_decl_column : 3
    <cfe>   DW_AT_type        : <0xccf>
 <1><d02>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <d03>   DW_AT_encoding    : 7	(unsigned)
    <d04>   DW_AT_byte_size   : 1
    <d05>   DW_AT_type        : <0x658>
    <d09>   DW_AT_decl_file   : 7
    <d0a>   DW_AT_decl_line   : 50
    <d0b>   DW_AT_decl_column : 1
    <d0c>   DW_AT_sibling     : <0xd1d>
 <2><d10>: Abbrev Number: 17 (DW_TAG_enumerator)
    <d11>   DW_AT_name        : (indirect string, offset: 0x8afad): HAL_UNLOCKED
    <d15>   DW_AT_const_value : 0
 <2><d16>: Abbrev Number: 17 (DW_TAG_enumerator)
    <d17>   DW_AT_name        : (indirect string, offset: 0x8b110): HAL_LOCKED
    <d1b>   DW_AT_const_value : 1
 <2><d1c>: Abbrev Number: 0
 <1><d1d>: Abbrev Number: 3 (DW_TAG_typedef)
    <d1e>   DW_AT_name        : (indirect string, offset: 0x8af79): HAL_LockTypeDef
    <d22>   DW_AT_decl_file   : 7
    <d23>   DW_AT_decl_line   : 53
    <d24>   DW_AT_decl_column : 3
    <d25>   DW_AT_type        : <0xd02>
 <1><d29>: Abbrev Number: 12 (DW_TAG_structure_type)
    <d2a>   DW_AT_byte_size   : 20
    <d2b>   DW_AT_decl_file   : 8
    <d2c>   DW_AT_decl_line   : 46
    <d2d>   DW_AT_decl_column : 9
    <d2e>   DW_AT_sibling     : <0xd74>
 <2><d32>: Abbrev Number: 13 (DW_TAG_member)
    <d33>   DW_AT_name        : Pin
    <d37>   DW_AT_decl_file   : 8
    <d38>   DW_AT_decl_line   : 48
    <d39>   DW_AT_decl_column : 12
    <d3a>   DW_AT_type        : <0x6c7>
    <d3e>   DW_AT_data_member_location: 0
 <2><d3f>: Abbrev Number: 14 (DW_TAG_member)
    <d40>   DW_AT_name        : (indirect string, offset: 0x8b5e7): Mode
    <d44>   DW_AT_decl_file   : 8
    <d45>   DW_AT_decl_line   : 51
    <d46>   DW_AT_decl_column : 12
    <d47>   DW_AT_type        : <0x6c7>
    <d4b>   DW_AT_data_member_location: 4
 <2><d4c>: Abbrev Number: 14 (DW_TAG_member)
    <d4d>   DW_AT_name        : (indirect string, offset: 0x8afd1): Pull
    <d51>   DW_AT_decl_file   : 8
    <d52>   DW_AT_decl_line   : 54
    <d53>   DW_AT_decl_column : 12
    <d54>   DW_AT_type        : <0x6c7>
    <d58>   DW_AT_data_member_location: 8
 <2><d59>: Abbrev Number: 14 (DW_TAG_member)
    <d5a>   DW_AT_name        : (indirect string, offset: 0x8c047): Speed
    <d5e>   DW_AT_decl_file   : 8
    <d5f>   DW_AT_decl_line   : 57
    <d60>   DW_AT_decl_column : 12
    <d61>   DW_AT_type        : <0x6c7>
    <d65>   DW_AT_data_member_location: 12
 <2><d66>: Abbrev Number: 14 (DW_TAG_member)
    <d67>   DW_AT_name        : (indirect string, offset: 0x8ae13): Alternate
    <d6b>   DW_AT_decl_file   : 8
    <d6c>   DW_AT_decl_line   : 60
    <d6d>   DW_AT_decl_column : 12
    <d6e>   DW_AT_type        : <0x6c7>
    <d72>   DW_AT_data_member_location: 16
 <2><d73>: Abbrev Number: 0
 <1><d74>: Abbrev Number: 3 (DW_TAG_typedef)
    <d75>   DW_AT_name        : (indirect string, offset: 0x8b4c7): GPIO_InitTypeDef
    <d79>   DW_AT_decl_file   : 8
    <d7a>   DW_AT_decl_line   : 62
    <d7b>   DW_AT_decl_column : 2
    <d7c>   DW_AT_type        : <0xd29>
 <1><d80>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <d81>   DW_AT_encoding    : 7	(unsigned)
    <d82>   DW_AT_byte_size   : 1
    <d83>   DW_AT_type        : <0x658>
    <d87>   DW_AT_decl_file   : 8
    <d88>   DW_AT_decl_line   : 68
    <d89>   DW_AT_decl_column : 1
    <d8a>   DW_AT_sibling     : <0xd9b>
 <2><d8e>: Abbrev Number: 17 (DW_TAG_enumerator)
    <d8f>   DW_AT_name        : (indirect string, offset: 0x87218): GPIO_PIN_RESET
    <d93>   DW_AT_const_value : 0
 <2><d94>: Abbrev Number: 17 (DW_TAG_enumerator)
    <d95>   DW_AT_name        : (indirect string, offset: 0x86f29): GPIO_PIN_SET
    <d99>   DW_AT_const_value : 1
 <2><d9a>: Abbrev Number: 0
 <1><d9b>: Abbrev Number: 3 (DW_TAG_typedef)
    <d9c>   DW_AT_name        : (indirect string, offset: 0x8aaa4): GPIO_PinState
    <da0>   DW_AT_decl_file   : 8
    <da1>   DW_AT_decl_line   : 71
    <da2>   DW_AT_decl_column : 2
    <da3>   DW_AT_type        : <0xd80>
 <1><da7>: Abbrev Number: 12 (DW_TAG_structure_type)
    <da8>   DW_AT_byte_size   : 48
    <da9>   DW_AT_decl_file   : 9
    <daa>   DW_AT_decl_line   : 48
    <dab>   DW_AT_decl_column : 9
    <dac>   DW_AT_sibling     : <0xe4d>
 <2><db0>: Abbrev Number: 14 (DW_TAG_member)
    <db1>   DW_AT_name        : (indirect string, offset: 0x8b3fb): Channel
    <db5>   DW_AT_decl_file   : 9
    <db6>   DW_AT_decl_line   : 50
    <db7>   DW_AT_decl_column : 12
    <db8>   DW_AT_type        : <0x6c7>
    <dbc>   DW_AT_data_member_location: 0
 <2><dbd>: Abbrev Number: 14 (DW_TAG_member)
    <dbe>   DW_AT_name        : (indirect string, offset: 0x8c17b): Direction
    <dc2>   DW_AT_decl_file   : 9
    <dc3>   DW_AT_decl_line   : 53
    <dc4>   DW_AT_decl_column : 12
    <dc5>   DW_AT_type        : <0x6c7>
    <dc9>   DW_AT_data_member_location: 4
 <2><dca>: Abbrev Number: 14 (DW_TAG_member)
    <dcb>   DW_AT_name        : (indirect string, offset: 0x8afe4): PeriphInc
    <dcf>   DW_AT_decl_file   : 9
    <dd0>   DW_AT_decl_line   : 57
    <dd1>   DW_AT_decl_column : 12
    <dd2>   DW_AT_type        : <0x6c7>
    <dd6>   DW_AT_data_member_location: 8
 <2><dd7>: Abbrev Number: 14 (DW_TAG_member)
    <dd8>   DW_AT_name        : (indirect string, offset: 0x8acf9): MemInc
    <ddc>   DW_AT_decl_file   : 9
    <ddd>   DW_AT_decl_line   : 60
    <dde>   DW_AT_decl_column : 12
    <ddf>   DW_AT_type        : <0x6c7>
    <de3>   DW_AT_data_member_location: 12
 <2><de4>: Abbrev Number: 14 (DW_TAG_member)
    <de5>   DW_AT_name        : (indirect string, offset: 0x8b17b): PeriphDataAlignment
    <de9>   DW_AT_decl_file   : 9
    <dea>   DW_AT_decl_line   : 63
    <deb>   DW_AT_decl_column : 12
    <dec>   DW_AT_type        : <0x6c7>
    <df0>   DW_AT_data_member_location: 16
 <2><df1>: Abbrev Number: 14 (DW_TAG_member)
    <df2>   DW_AT_name        : (indirect string, offset: 0x8af68): MemDataAlignment
    <df6>   DW_AT_decl_file   : 9
    <df7>   DW_AT_decl_line   : 66
    <df8>   DW_AT_decl_column : 12
    <df9>   DW_AT_type        : <0x6c7>
    <dfd>   DW_AT_data_member_location: 20
 <2><dfe>: Abbrev Number: 14 (DW_TAG_member)
    <dff>   DW_AT_name        : (indirect string, offset: 0x8b5e7): Mode
    <e03>   DW_AT_decl_file   : 9
    <e04>   DW_AT_decl_line   : 69
    <e05>   DW_AT_decl_column : 12
    <e06>   DW_AT_type        : <0x6c7>
    <e0a>   DW_AT_data_member_location: 24
 <2><e0b>: Abbrev Number: 14 (DW_TAG_member)
    <e0c>   DW_AT_name        : (indirect string, offset: 0x903ea): Priority
    <e10>   DW_AT_decl_file   : 9
    <e11>   DW_AT_decl_line   : 74
    <e12>   DW_AT_decl_column : 12
    <e13>   DW_AT_type        : <0x6c7>
    <e17>   DW_AT_data_member_location: 28
 <2><e18>: Abbrev Number: 14 (DW_TAG_member)
    <e19>   DW_AT_name        : (indirect string, offset: 0x8ad20): FIFOMode
    <e1d>   DW_AT_decl_file   : 9
    <e1e>   DW_AT_decl_line   : 77
    <e1f>   DW_AT_decl_column : 12
    <e20>   DW_AT_type        : <0x6c7>
    <e24>   DW_AT_data_member_location: 32
 <2><e25>: Abbrev Number: 14 (DW_TAG_member)
    <e26>   DW_AT_name        : (indirect string, offset: 0x8af36): FIFOThreshold
    <e2a>   DW_AT_decl_file   : 9
    <e2b>   DW_AT_decl_line   : 82
    <e2c>   DW_AT_decl_column : 12
    <e2d>   DW_AT_type        : <0x6c7>
    <e31>   DW_AT_data_member_location: 36
 <2><e32>: Abbrev Number: 14 (DW_TAG_member)
    <e33>   DW_AT_name        : (indirect string, offset: 0x8b397): MemBurst
    <e37>   DW_AT_decl_file   : 9
    <e38>   DW_AT_decl_line   : 85
    <e39>   DW_AT_decl_column : 12
    <e3a>   DW_AT_type        : <0x6c7>
    <e3e>   DW_AT_data_member_location: 40
 <2><e3f>: Abbrev Number: 14 (DW_TAG_member)
    <e40>   DW_AT_name        : (indirect string, offset: 0x8b3e1): PeriphBurst
    <e44>   DW_AT_decl_file   : 9
    <e45>   DW_AT_decl_line   : 91
    <e46>   DW_AT_decl_column : 12
    <e47>   DW_AT_type        : <0x6c7>
    <e4b>   DW_AT_data_member_location: 44
 <2><e4c>: Abbrev Number: 0
 <1><e4d>: Abbrev Number: 3 (DW_TAG_typedef)
    <e4e>   DW_AT_name        : (indirect string, offset: 0x8b27f): DMA_InitTypeDef
    <e52>   DW_AT_decl_file   : 9
    <e53>   DW_AT_decl_line   : 96
    <e54>   DW_AT_decl_column : 2
    <e55>   DW_AT_type        : <0xda7>
 <1><e59>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <e5a>   DW_AT_encoding    : 7	(unsigned)
    <e5b>   DW_AT_byte_size   : 1
    <e5c>   DW_AT_type        : <0x658>
    <e60>   DW_AT_decl_file   : 9
    <e61>   DW_AT_decl_line   : 103
    <e62>   DW_AT_decl_column : 1
    <e63>   DW_AT_sibling     : <0xe8c>
 <2><e67>: Abbrev Number: 17 (DW_TAG_enumerator)
    <e68>   DW_AT_name        : (indirect string, offset: 0x8abcc): HAL_DMA_STATE_RESET
    <e6c>   DW_AT_const_value : 0
 <2><e6d>: Abbrev Number: 17 (DW_TAG_enumerator)
    <e6e>   DW_AT_name        : (indirect string, offset: 0x8acd0): HAL_DMA_STATE_READY
    <e72>   DW_AT_const_value : 1
 <2><e73>: Abbrev Number: 17 (DW_TAG_enumerator)
    <e74>   DW_AT_name        : (indirect string, offset: 0x8b1d0): HAL_DMA_STATE_BUSY
    <e78>   DW_AT_const_value : 2
 <2><e79>: Abbrev Number: 17 (DW_TAG_enumerator)
    <e7a>   DW_AT_name        : (indirect string, offset: 0x8b025): HAL_DMA_STATE_TIMEOUT
    <e7e>   DW_AT_const_value : 3
 <2><e7f>: Abbrev Number: 17 (DW_TAG_enumerator)
    <e80>   DW_AT_name        : (indirect string, offset: 0x8aeed): HAL_DMA_STATE_ERROR
    <e84>   DW_AT_const_value : 4
 <2><e85>: Abbrev Number: 17 (DW_TAG_enumerator)
    <e86>   DW_AT_name        : (indirect string, offset: 0x8aea0): HAL_DMA_STATE_ABORT
    <e8a>   DW_AT_const_value : 5
 <2><e8b>: Abbrev Number: 0
 <1><e8c>: Abbrev Number: 3 (DW_TAG_typedef)
    <e8d>   DW_AT_name        : (indirect string, offset: 0x8b2d9): HAL_DMA_StateTypeDef
    <e91>   DW_AT_decl_file   : 9
    <e92>   DW_AT_decl_line   : 110
    <e93>   DW_AT_decl_column : 2
    <e94>   DW_AT_type        : <0xe59>
 <1><e98>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <e99>   DW_AT_type        : <0xe8c>
 <1><e9d>: Abbrev Number: 18 (DW_TAG_structure_type)
    <e9e>   DW_AT_name        : (indirect string, offset: 0x8b330): __DMA_HandleTypeDef
    <ea2>   DW_AT_byte_size   : 96
    <ea3>   DW_AT_decl_file   : 9
    <ea4>   DW_AT_decl_line   : 138
    <ea5>   DW_AT_decl_column : 16
    <ea6>   DW_AT_sibling     : <0xf61>
 <2><eaa>: Abbrev Number: 14 (DW_TAG_member)
    <eab>   DW_AT_name        : (indirect string, offset: 0x8af2d): Instance
    <eaf>   DW_AT_decl_file   : 9
    <eb0>   DW_AT_decl_line   : 140
    <eb1>   DW_AT_decl_column : 31
    <eb2>   DW_AT_type        : <0xf61>
    <eb6>   DW_AT_data_member_location: 0
 <2><eb7>: Abbrev Number: 14 (DW_TAG_member)
    <eb8>   DW_AT_name        : (indirect string, offset: 0x8d014): Init
    <ebc>   DW_AT_decl_file   : 9
    <ebd>   DW_AT_decl_line   : 142
    <ebe>   DW_AT_decl_column : 30
    <ebf>   DW_AT_type        : <0xe4d>
    <ec3>   DW_AT_data_member_location: 4
 <2><ec4>: Abbrev Number: 14 (DW_TAG_member)
    <ec5>   DW_AT_name        : (indirect string, offset: 0x44e98): Lock
    <ec9>   DW_AT_decl_file   : 9
    <eca>   DW_AT_decl_line   : 144
    <ecb>   DW_AT_decl_column : 30
    <ecc>   DW_AT_type        : <0xd1d>
    <ed0>   DW_AT_data_member_location: 52
 <2><ed1>: Abbrev Number: 14 (DW_TAG_member)
    <ed2>   DW_AT_name        : (indirect string, offset: 0x8e853): State
    <ed6>   DW_AT_decl_file   : 9
    <ed7>   DW_AT_decl_line   : 146
    <ed8>   DW_AT_decl_column : 30
    <ed9>   DW_AT_type        : <0xe98>
    <edd>   DW_AT_data_member_location: 53
 <2><ede>: Abbrev Number: 14 (DW_TAG_member)
    <edf>   DW_AT_name        : (indirect string, offset: 0x8b224): Parent
    <ee3>   DW_AT_decl_file   : 9
    <ee4>   DW_AT_decl_line   : 148
    <ee5>   DW_AT_decl_column : 31
    <ee6>   DW_AT_type        : <0xf67>
    <eea>   DW_AT_data_member_location: 56
 <2><eeb>: Abbrev Number: 14 (DW_TAG_member)
    <eec>   DW_AT_name        : (indirect string, offset: 0x8b1ff): XferCpltCallback
    <ef0>   DW_AT_decl_file   : 9
    <ef1>   DW_AT_decl_line   : 150
    <ef2>   DW_AT_decl_column : 33
    <ef3>   DW_AT_type        : <0xf7a>
    <ef7>   DW_AT_data_member_location: 60
 <2><ef8>: Abbrev Number: 14 (DW_TAG_member)
    <ef9>   DW_AT_name        : (indirect string, offset: 0x8ace4): XferHalfCpltCallback
    <efd>   DW_AT_decl_file   : 9
    <efe>   DW_AT_decl_line   : 152
    <eff>   DW_AT_decl_column : 33
    <f00>   DW_AT_type        : <0xf7a>
    <f04>   DW_AT_data_member_location: 64
 <2><f05>: Abbrev Number: 14 (DW_TAG_member)
    <f06>   DW_AT_name        : (indirect string, offset: 0x8b3be): XferM1CpltCallback
    <f0a>   DW_AT_decl_file   : 9
    <f0b>   DW_AT_decl_line   : 154
    <f0c>   DW_AT_decl_column : 33
    <f0d>   DW_AT_type        : <0xf7a>
    <f11>   DW_AT_data_member_location: 68
 <2><f12>: Abbrev Number: 14 (DW_TAG_member)
    <f13>   DW_AT_name        : (indirect string, offset: 0x8ae7d): XferM1HalfCpltCallback
    <f17>   DW_AT_decl_file   : 9
    <f18>   DW_AT_decl_line   : 156
    <f19>   DW_AT_decl_column : 33
    <f1a>   DW_AT_type        : <0xf7a>
    <f1e>   DW_AT_data_member_location: 72
 <2><f1f>: Abbrev Number: 14 (DW_TAG_member)
    <f20>   DW_AT_name        : (indirect string, offset: 0x8b4f6): XferErrorCallback
    <f24>   DW_AT_decl_file   : 9
    <f25>   DW_AT_decl_line   : 158
    <f26>   DW_AT_decl_column : 33
    <f27>   DW_AT_type        : <0xf7a>
    <f2b>   DW_AT_data_member_location: 76
 <2><f2c>: Abbrev Number: 14 (DW_TAG_member)
    <f2d>   DW_AT_name        : (indirect string, offset: 0x8ac9c): XferAbortCallback
    <f31>   DW_AT_decl_file   : 9
    <f32>   DW_AT_decl_line   : 160
    <f33>   DW_AT_decl_column : 33
    <f34>   DW_AT_type        : <0xf7a>
    <f38>   DW_AT_data_member_location: 80
 <2><f39>: Abbrev Number: 14 (DW_TAG_member)
    <f3a>   DW_AT_name        : (indirect string, offset: 0x8b05e): ErrorCode
    <f3e>   DW_AT_decl_file   : 9
    <f3f>   DW_AT_decl_line   : 162
    <f40>   DW_AT_decl_column : 30
    <f41>   DW_AT_type        : <0x6d3>
    <f45>   DW_AT_data_member_location: 84
 <2><f46>: Abbrev Number: 14 (DW_TAG_member)
    <f47>   DW_AT_name        : (indirect string, offset: 0x8af56): StreamBaseAddress
    <f4b>   DW_AT_decl_file   : 9
    <f4c>   DW_AT_decl_line   : 164
    <f4d>   DW_AT_decl_column : 30
    <f4e>   DW_AT_type        : <0x6c7>
    <f52>   DW_AT_data_member_location: 88
 <2><f53>: Abbrev Number: 14 (DW_TAG_member)
    <f54>   DW_AT_name        : (indirect string, offset: 0x8ae94): StreamIndex
    <f58>   DW_AT_decl_file   : 9
    <f59>   DW_AT_decl_line   : 166
    <f5a>   DW_AT_decl_column : 30
    <f5b>   DW_AT_type        : <0x6c7>
    <f5f>   DW_AT_data_member_location: 92
 <2><f60>: Abbrev Number: 0
 <1><f61>: Abbrev Number: 19 (DW_TAG_pointer_type)
    <f62>   DW_AT_byte_size   : 4
    <f63>   DW_AT_type        : <0x8fe>
 <1><f67>: Abbrev Number: 20 (DW_TAG_pointer_type)
    <f68>   DW_AT_byte_size   : 4
 <1><f69>: Abbrev Number: 21 (DW_TAG_subroutine_type)
    <f6a>   DW_AT_prototyped  : 1
    <f6a>   DW_AT_sibling     : <0xf74>
 <2><f6e>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <f6f>   DW_AT_type        : <0xf74>
 <2><f73>: Abbrev Number: 0
 <1><f74>: Abbrev Number: 19 (DW_TAG_pointer_type)
    <f75>   DW_AT_byte_size   : 4
    <f76>   DW_AT_type        : <0xe9d>
 <1><f7a>: Abbrev Number: 19 (DW_TAG_pointer_type)
    <f7b>   DW_AT_byte_size   : 4
    <f7c>   DW_AT_type        : <0xf69>
 <1><f80>: Abbrev Number: 3 (DW_TAG_typedef)
    <f81>   DW_AT_name        : (indirect string, offset: 0x8b332): DMA_HandleTypeDef
    <f85>   DW_AT_decl_file   : 9
    <f86>   DW_AT_decl_line   : 168
    <f87>   DW_AT_decl_column : 2
    <f88>   DW_AT_type        : <0xe9d>
 <1><f8c>: Abbrev Number: 12 (DW_TAG_structure_type)
    <f8d>   DW_AT_byte_size   : 24
    <f8e>   DW_AT_decl_file   : 10
    <f8f>   DW_AT_decl_line   : 46
    <f90>   DW_AT_decl_column : 9
    <f91>   DW_AT_sibling     : <0xfe4>
 <2><f95>: Abbrev Number: 14 (DW_TAG_member)
    <f96>   DW_AT_name        : (indirect string, offset: 0x90f76): Prescaler
    <f9a>   DW_AT_decl_file   : 10
    <f9b>   DW_AT_decl_line   : 48
    <f9c>   DW_AT_decl_column : 12
    <f9d>   DW_AT_type        : <0x6c7>
    <fa1>   DW_AT_data_member_location: 0
 <2><fa2>: Abbrev Number: 14 (DW_TAG_member)
    <fa3>   DW_AT_name        : (indirect string, offset: 0x8b22b): CounterMode
    <fa7>   DW_AT_decl_file   : 10
    <fa8>   DW_AT_decl_line   : 51
    <fa9>   DW_AT_decl_column : 12
    <faa>   DW_AT_type        : <0x6c7>
    <fae>   DW_AT_data_member_location: 4
 <2><faf>: Abbrev Number: 14 (DW_TAG_member)
    <fb0>   DW_AT_name        : (indirect string, offset: 0x96e77): Period
    <fb4>   DW_AT_decl_file   : 10
    <fb5>   DW_AT_decl_line   : 54
    <fb6>   DW_AT_decl_column : 12
    <fb7>   DW_AT_type        : <0x6c7>
    <fbb>   DW_AT_data_member_location: 8
 <2><fbc>: Abbrev Number: 14 (DW_TAG_member)
    <fbd>   DW_AT_name        : (indirect string, offset: 0x8afd6): ClockDivision
    <fc1>   DW_AT_decl_file   : 10
    <fc2>   DW_AT_decl_line   : 58
    <fc3>   DW_AT_decl_column : 12
    <fc4>   DW_AT_type        : <0x6c7>
    <fc8>   DW_AT_data_member_location: 12
 <2><fc9>: Abbrev Number: 14 (DW_TAG_member)
    <fca>   DW_AT_name        : (indirect string, offset: 0x8b4de): RepetitionCounter
    <fce>   DW_AT_decl_file   : 10
    <fcf>   DW_AT_decl_line   : 61
    <fd0>   DW_AT_decl_column : 12
    <fd1>   DW_AT_type        : <0x6c7>
    <fd5>   DW_AT_data_member_location: 16
 <2><fd6>: Abbrev Number: 14 (DW_TAG_member)
    <fd7>   DW_AT_name        : (indirect string, offset: 0x8b385): AutoReloadPreload
    <fdb>   DW_AT_decl_file   : 10
    <fdc>   DW_AT_decl_line   : 72
    <fdd>   DW_AT_decl_column : 12
    <fde>   DW_AT_type        : <0x6c7>
    <fe2>   DW_AT_data_member_location: 20
 <2><fe3>: Abbrev Number: 0
 <1><fe4>: Abbrev Number: 3 (DW_TAG_typedef)
    <fe5>   DW_AT_name        : (indirect string, offset: 0x8aed8): TIM_Base_InitTypeDef
    <fe9>   DW_AT_decl_file   : 10
    <fea>   DW_AT_decl_line   : 74
    <feb>   DW_AT_decl_column : 3
    <fec>   DW_AT_type        : <0xf8c>
 <1><ff0>: Abbrev Number: 12 (DW_TAG_structure_type)
    <ff1>   DW_AT_byte_size   : 16
    <ff2>   DW_AT_decl_file   : 10
    <ff3>   DW_AT_decl_line   : 147
    <ff4>   DW_AT_decl_column : 9
    <ff5>   DW_AT_sibling     : <0x102e>
 <2><ff9>: Abbrev Number: 14 (DW_TAG_member)
    <ffa>   DW_AT_name        : (indirect string, offset: 0x90c24): ICPolarity
    <ffe>   DW_AT_decl_file   : 10
    <fff>   DW_AT_decl_line   : 149
    <1000>   DW_AT_decl_column : 13
    <1001>   DW_AT_type        : <0x6c7>
    <1005>   DW_AT_data_member_location: 0
 <2><1006>: Abbrev Number: 14 (DW_TAG_member)
    <1007>   DW_AT_name        : (indirect string, offset: 0x90dba): ICSelection
    <100b>   DW_AT_decl_file   : 10
    <100c>   DW_AT_decl_line   : 152
    <100d>   DW_AT_decl_column : 12
    <100e>   DW_AT_type        : <0x6c7>
    <1012>   DW_AT_data_member_location: 4
 <2><1013>: Abbrev Number: 14 (DW_TAG_member)
    <1014>   DW_AT_name        : (indirect string, offset: 0x8b379): ICPrescaler
    <1018>   DW_AT_decl_file   : 10
    <1019>   DW_AT_decl_line   : 155
    <101a>   DW_AT_decl_column : 12
    <101b>   DW_AT_type        : <0x6c7>
    <101f>   DW_AT_data_member_location: 8
 <2><1020>: Abbrev Number: 14 (DW_TAG_member)
    <1021>   DW_AT_name        : (indirect string, offset: 0x90fa0): ICFilter
    <1025>   DW_AT_decl_file   : 10
    <1026>   DW_AT_decl_line   : 158
    <1027>   DW_AT_decl_column : 12
    <1028>   DW_AT_type        : <0x6c7>
    <102c>   DW_AT_data_member_location: 12
 <2><102d>: Abbrev Number: 0
 <1><102e>: Abbrev Number: 3 (DW_TAG_typedef)
    <102f>   DW_AT_name        : (indirect string, offset: 0x8af01): TIM_IC_InitTypeDef
    <1033>   DW_AT_decl_file   : 10
    <1034>   DW_AT_decl_line   : 160
    <1035>   DW_AT_decl_column : 3
    <1036>   DW_AT_type        : <0xff0>
 <1><103a>: Abbrev Number: 12 (DW_TAG_structure_type)
    <103b>   DW_AT_byte_size   : 16
    <103c>   DW_AT_decl_file   : 10
    <103d>   DW_AT_decl_line   : 198
    <103e>   DW_AT_decl_column : 9
    <103f>   DW_AT_sibling     : <0x1078>
 <2><1043>: Abbrev Number: 14 (DW_TAG_member)
    <1044>   DW_AT_name        : (indirect string, offset: 0x8adb7): ClockSource
    <1048>   DW_AT_decl_file   : 10
    <1049>   DW_AT_decl_line   : 200
    <104a>   DW_AT_decl_column : 12
    <104b>   DW_AT_type        : <0x6c7>
    <104f>   DW_AT_data_member_location: 0
 <2><1050>: Abbrev Number: 14 (DW_TAG_member)
    <1051>   DW_AT_name        : (indirect string, offset: 0x8ae05): ClockPolarity
    <1055>   DW_AT_decl_file   : 10
    <1056>   DW_AT_decl_line   : 202
    <1057>   DW_AT_decl_column : 12
    <1058>   DW_AT_type        : <0x6c7>
    <105c>   DW_AT_data_member_location: 4
 <2><105d>: Abbrev Number: 14 (DW_TAG_member)
    <105e>   DW_AT_name        : (indirect string, offset: 0x8ad9a): ClockPrescaler
    <1062>   DW_AT_decl_file   : 10
    <1063>   DW_AT_decl_line   : 204
    <1064>   DW_AT_decl_column : 12
    <1065>   DW_AT_type        : <0x6c7>
    <1069>   DW_AT_data_member_location: 8
 <2><106a>: Abbrev Number: 14 (DW_TAG_member)
    <106b>   DW_AT_name        : (indirect string, offset: 0x8b1b7): ClockFilter
    <106f>   DW_AT_decl_file   : 10
    <1070>   DW_AT_decl_line   : 206
    <1071>   DW_AT_decl_column : 12
    <1072>   DW_AT_type        : <0x6c7>
    <1076>   DW_AT_data_member_location: 12
 <2><1077>: Abbrev Number: 0
 <1><1078>: Abbrev Number: 3 (DW_TAG_typedef)
    <1079>   DW_AT_name        : (indirect string, offset: 0x8ad00): TIM_ClockConfigTypeDef
    <107d>   DW_AT_decl_file   : 10
    <107e>   DW_AT_decl_line   : 208
    <107f>   DW_AT_decl_column : 3
    <1080>   DW_AT_type        : <0x103a>
 <1><1084>: Abbrev Number: 12 (DW_TAG_structure_type)
    <1085>   DW_AT_byte_size   : 8
    <1086>   DW_AT_decl_file   : 10
    <1087>   DW_AT_decl_line   : 231
    <1088>   DW_AT_decl_column : 9
    <1089>   DW_AT_sibling     : <0x10a8>
 <2><108d>: Abbrev Number: 14 (DW_TAG_member)
    <108e>   DW_AT_name        : (indirect string, offset: 0x8b077): MasterOutputTrigger
    <1092>   DW_AT_decl_file   : 10
    <1093>   DW_AT_decl_line   : 233
    <1094>   DW_AT_decl_column : 13
    <1095>   DW_AT_type        : <0x6c7>
    <1099>   DW_AT_data_member_location: 0
 <2><109a>: Abbrev Number: 14 (DW_TAG_member)
    <109b>   DW_AT_name        : (indirect string, offset: 0x8b2ab): MasterSlaveMode
    <109f>   DW_AT_decl_file   : 10
    <10a0>   DW_AT_decl_line   : 235
    <10a1>   DW_AT_decl_column : 13
    <10a2>   DW_AT_type        : <0x6c7>
    <10a6>   DW_AT_data_member_location: 4
 <2><10a7>: Abbrev Number: 0
 <1><10a8>: Abbrev Number: 3 (DW_TAG_typedef)
    <10a9>   DW_AT_name        : (indirect string, offset: 0x8b0b5): TIM_MasterConfigTypeDef
    <10ad>   DW_AT_decl_file   : 10
    <10ae>   DW_AT_decl_line   : 242
    <10af>   DW_AT_decl_column : 3
    <10b0>   DW_AT_type        : <0x1084>
 <1><10b4>: Abbrev Number: 23 (DW_TAG_enumeration_type)
    <10b5>   DW_AT_encoding    : 7	(unsigned)
    <10b6>   DW_AT_byte_size   : 1
    <10b7>   DW_AT_type        : <0x658>
    <10bb>   DW_AT_decl_file   : 10
    <10bc>   DW_AT_decl_line   : 291
    <10be>   DW_AT_decl_column : 1
    <10bf>   DW_AT_sibling     : <0x10e2>
 <2><10c3>: Abbrev Number: 17 (DW_TAG_enumerator)
    <10c4>   DW_AT_name        : (indirect string, offset: 0x8b54b): HAL_TIM_STATE_RESET
    <10c8>   DW_AT_const_value : 0
 <2><10c9>: Abbrev Number: 17 (DW_TAG_enumerator)
    <10ca>   DW_AT_name        : (indirect string, offset: 0x8acae): HAL_TIM_STATE_READY
    <10ce>   DW_AT_const_value : 1
 <2><10cf>: Abbrev Number: 17 (DW_TAG_enumerator)
    <10d0>   DW_AT_name        : (indirect string, offset: 0x8adec): HAL_TIM_STATE_BUSY
    <10d4>   DW_AT_const_value : 2
 <2><10d5>: Abbrev Number: 17 (DW_TAG_enumerator)
    <10d6>   DW_AT_name        : (indirect string, offset: 0x8b1e3): HAL_TIM_STATE_TIMEOUT
    <10da>   DW_AT_const_value : 3
 <2><10db>: Abbrev Number: 17 (DW_TAG_enumerator)
    <10dc>   DW_AT_name        : (indirect string, offset: 0x8b00a): HAL_TIM_STATE_ERROR
    <10e0>   DW_AT_const_value : 4
 <2><10e1>: Abbrev Number: 0
 <1><10e2>: Abbrev Number: 11 (DW_TAG_typedef)
    <10e3>   DW_AT_name        : (indirect string, offset: 0x8b296): HAL_TIM_StateTypeDef
    <10e7>   DW_AT_decl_file   : 10
    <10e8>   DW_AT_decl_line   : 297
    <10ea>   DW_AT_decl_column : 3
    <10eb>   DW_AT_type        : <0x10b4>
 <1><10ef>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <10f0>   DW_AT_type        : <0x10e2>
 <1><10f4>: Abbrev Number: 23 (DW_TAG_enumeration_type)
    <10f5>   DW_AT_encoding    : 7	(unsigned)
    <10f6>   DW_AT_byte_size   : 1
    <10f7>   DW_AT_type        : <0x658>
    <10fb>   DW_AT_decl_file   : 10
    <10fc>   DW_AT_decl_line   : 303
    <10fe>   DW_AT_decl_column : 1
    <10ff>   DW_AT_sibling     : <0x1116>
 <2><1103>: Abbrev Number: 17 (DW_TAG_enumerator)
    <1104>   DW_AT_name        : (indirect string, offset: 0x8af91): HAL_TIM_CHANNEL_STATE_RESET
    <1108>   DW_AT_const_value : 0
 <2><1109>: Abbrev Number: 17 (DW_TAG_enumerator)
    <110a>   DW_AT_name        : (indirect string, offset: 0x8afee): HAL_TIM_CHANNEL_STATE_READY
    <110e>   DW_AT_const_value : 1
 <2><110f>: Abbrev Number: 17 (DW_TAG_enumerator)
    <1110>   DW_AT_name        : (indirect string, offset: 0x8b40b): HAL_TIM_CHANNEL_STATE_BUSY
    <1114>   DW_AT_const_value : 2
 <2><1115>: Abbrev Number: 0
 <1><1116>: Abbrev Number: 11 (DW_TAG_typedef)
    <1117>   DW_AT_name        : (indirect string, offset: 0x8b48b): HAL_TIM_ChannelStateTypeDef
    <111b>   DW_AT_decl_file   : 10
    <111c>   DW_AT_decl_line   : 307
    <111e>   DW_AT_decl_column : 3
    <111f>   DW_AT_type        : <0x10f4>
 <1><1123>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <1124>   DW_AT_type        : <0x1116>
 <1><1128>: Abbrev Number: 23 (DW_TAG_enumeration_type)
    <1129>   DW_AT_encoding    : 7	(unsigned)
    <112a>   DW_AT_byte_size   : 1
    <112b>   DW_AT_type        : <0x658>
    <112f>   DW_AT_decl_file   : 10
    <1130>   DW_AT_decl_line   : 313
    <1132>   DW_AT_decl_column : 1
    <1133>   DW_AT_sibling     : <0x114a>
 <2><1137>: Abbrev Number: 17 (DW_TAG_enumerator)
    <1138>   DW_AT_name        : (indirect string, offset: 0x8b03b): HAL_DMA_BURST_STATE_RESET
    <113c>   DW_AT_const_value : 0
 <2><113d>: Abbrev Number: 17 (DW_TAG_enumerator)
    <113e>   DW_AT_name        : (indirect string, offset: 0x8b0f6): HAL_DMA_BURST_STATE_READY
    <1142>   DW_AT_const_value : 1
 <2><1143>: Abbrev Number: 17 (DW_TAG_enumerator)
    <1144>   DW_AT_name        : (indirect string, offset: 0x8b139): HAL_DMA_BURST_STATE_BUSY
    <1148>   DW_AT_const_value : 2
 <2><1149>: Abbrev Number: 0
 <1><114a>: Abbrev Number: 11 (DW_TAG_typedef)
    <114b>   DW_AT_name        : (indirect string, offset: 0x8b34c): HAL_TIM_DMABurstStateTypeDef
    <114f>   DW_AT_decl_file   : 10
    <1150>   DW_AT_decl_line   : 317
    <1152>   DW_AT_decl_column : 3
    <1153>   DW_AT_type        : <0x1128>
 <1><1157>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <1158>   DW_AT_type        : <0x114a>
 <1><115c>: Abbrev Number: 23 (DW_TAG_enumeration_type)
    <115d>   DW_AT_encoding    : 7	(unsigned)
    <115e>   DW_AT_byte_size   : 1
    <115f>   DW_AT_type        : <0x658>
    <1163>   DW_AT_decl_file   : 10
    <1164>   DW_AT_decl_line   : 323
